[
{"content": "The Ministry of Education has decided to launch a special Dengue eradication school program on 28th, 29th and 30th of July with the intention of converting all schools in the country into Dengue free zones.", "title": "Three forces and the police join in the island wide school Dengue eradication special program which starts from tomorrow"},
{"content": "• A special island wide program to make the school premises tidy during the days 28, 29 and 30 of July", "title": "A special island wide program to make the school premises tidy during the days 28, 29 and 30 of July"},
{"content": "International criterion is that there should be at least 10 reading books for each child studying in a school. Accordingly, The Minister of Education Akila Viraj Kariyawasam has instructed the relevant officials to prepare a special program to increase the number of books used in the school libraries by 50% during the next five years’ time. As one step of that program, a program has been implemented now to provide 700 million rupees to 3200 schools for purchasing library books under the program of “The nearest school is the best school”.", "title": "Library books worth of 700 million for 3200 schools"},
{"content": "All island school dancing competitions, 2017 conducted by the ministry of education are scheduled to be held in 13 schools in Gampaha education zone on 29th and 30th July 2017.", "title": "All island school dancing competitions, 2017 at Gampaha"},
{"content": "The arrangements have been made to hold in grand scale the 14th Summit of World Young Buddhist Monks Council in Sri Lanka this time. The Minister of Education Akila Viraj Kariyawasam holds the chairmanship of its management committee and there was a special discussion today morning (19) at the Apegama premises about the arrangements of holding the summit. It has been planned to take place the proceedings of this summit at the Bandaranayaka Memorial Conference Hall, Provincial Council Conference Hall at Pallekelle, Kandy and Millawana Maha Vidyalaya, Galewela from 27th to 30th October. This summit is held in Sri Lanka for the third time in which about thousand young Buddhist priests belonging to the sects of Therawada, Mahayana, Thanthrayana, Wajrayana and Sen around the world. So far this summit has been held in Malaysia, Thailand, Australia, Japan, Germany, Switzerland, Belgium and the United States of America since the first summit held in Nepal in 2004.", "title": "The 14th Summit of World Young Buddhist Monks Council is held this time in Sri Lanka"},
{"content": "The Minister of Education Akila Viraj Kariyawasam made a strong promise in front of Ruwanweli Dagoba recently saying that he will act dedicatedly to protect the Buddhism and the Buddhist heritage of this country disregarding any obstacle he faces. He stated this while participating in the ceremony held for offering the sand compound of Ruwanweli Dagoba after the renovation of it under the instructions of The Prime Minister Ranil Wickramasinghe and the chief incumbent of the Ruwanweli Dagoba most venerable Pallegama Hemarathana Nayaka Thera.", "title": "A strong promise from The Minister of Education Akila Viraj Kariyawasam in front of Ruwanweli Dagoba to be dedicated for the protection of the Buddhism and the Buddhist heritage of this country"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that it is a contemporary requirement to provide training opportunities for the Archeological officers in our country for acquiring the international level expertise and for Archeological research studies. If the allocations in the Department of Archeology is not sufficient for this purpose he is ready to take action to provide necessary funds even through a cabinet paper, the minister says.", "title": "Steps will be taken to provide international training for Archeological officers to improve the field of Archeology – The Minister of Education Akila Viraj Kariyawasam "},
{"content": "More than two hundred and fifty thousand valuable Archeological sites in the country have been identified so far and it is his expectation to act responsibly using the powers vested on him through the Antiquities Ordinance for the conservation of valuable Archeological sites and monuments without yielding to any political influence, says The Minister of Education Akila Viraj Kariyawasam.", "title": "“Actions will be taken for the advancement of Archeological field without giving in to any political influence” – The Minister of Education Akila Viraj Kariyawasam"},
{"content": "A media briefing was held at the Department of Government Information yesterday (04) with the headship of The Minister of Education Akila Viraj Kariyawasam to sensitize the current situation of the Dambulla cave temple.", "title": "A media briefing to sensitize the current situation of Dambulla cave temple"},
{"content": " Steps for making the subject Computer Information and Communication Technology compulsory", "title": "Allocation of 8 billion rupees for the promotion of hygienic facilities in the schools"},
{"content": "A function is held annually to admit children to grade one in schools and this year the national function for grade one admissions has been scheduled to be held at 8.00 am on 15th January 2018 at Isipathana College, Colombo. ", "title": "Grade one admissions for 2018 are on 15th January 2018"},
{"content": "Special attention of The Minister of Education Akila Viraj Kariyawasam has been drawn towards the combination of digital learning technology with the school education system in order to create a generation of excellent teachers who are capable of encountering modern technical challenges successfully and also able to contribute actively to achieve the quality of education.", "title": "Kelaniya University joins with the Ministry of Education to empower the elearning process"},
{"content": "Three year national plan of school cricket is launched under the patronage of the Minister of Education.", "title": "It is possible to create a strong future nationally and internationally for the game of cricket in this country through the promotion of cricket at school level – The Minister of Education Akila Viraj Kariyawasam"},
{"content": "“Be vigilant to identify the potential problems of the procedures of institutions related to the field of education as early as possible and to provide immediate solutions” – Instructions to the officers from the Minister of Education in the New Year", "title": "‘Let’s make the new year an innovative one with new thoughts’ – The Minister of Education Akila Viraj Kariyawasam"},
{"content": "2017 Grade 5 scholarship examination, the cut off marks for both Sinhala and Tamil media schools were announced for admitting students to Grade 6 in the year 2018.", "title": "Grade 5 scholarship exam in year 2017  school cut off marks"},
{"content": "Several special programs are being implemented under the guidance of The Minister of Education Akila Viraj Kariyawasam for the creation of a school community with the ability of overcoming technological challenges while advancing with the rapidly changing world.", "title": "Steps for popularizing the three dimensional printing technology from school level"},
{"content": "The Minister of Education Akila Viraj Kariyawasam stated that for the protection of future generation from the danger of drugs, not only school community but the involvement of outside parties are also very important. The minister stated this recently in an explanation on the same at the parliament.", "title": "“For the protection of future generation from the danger of drugs, not only school community but the involvement of outside parties also very important”  The Minister of Education Akila Viraj Kariyawasam"},
{"content": "The minister of education expressing his ideas at this occasion said that the most valuable resource of the country is the children and he always appears for empowering the future of children through education as the minister in charge of the subject. As another important step of that endeavor, actions were taken after obtaining the cabinet approval to give gift vouchers for shoes to identified school children. ", "title": "Gift vouchers for underprivileged school children to buy shoes encouraging them to step safely into the future"},
{"content": "The Minister of Education Akila Viraj Kariyawasam has drawn his attention to limit the compulsory subjects of G.C.E. (Ordinary Level) Examination up to 06 in the future in order to bring about a quality change in the children’s education. The minister stated this while attending the function of National Suraksha Student Insurance Day held at Anula Vidyalaya, Nugegoda today (07). The minister also pointed out at this occasion that in addition to this it is expected to make a major revision in the curriculum of all other subjects after an advanced practical evaluation of them in the future. ", "title": "Attention is drawn to limit the number of compulsory subjects up to 06 for G.C.E. (Ordinary Level) Examination considering the quality development of education  the minister of education says while participating in the function of National Suraksha Stude"},
{"content": "The General Certificate of Education (Ordinary Level) Examination which is scheduled to be held under the new and old syllabuses from 12.12.2017 till 21.12.2017 will start at 08.30am and all the candidates must come to the examination centers mentioned in their admission cards before 08.00am.", "title": "A special communiqué from the Department of Examinations to the candidates of the General Certificate of Education (Ordinary Level) new/old syllabus Examination and the principals of relevant schools and the parents….."},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that he considers as his responsibility to take correct decisions for common sake though somebody may dislike it. The minister emphasized that there is no way to satisfy everybody in the educational policy formation just like distributing ice creams and he will dedicate to take bold decisions for the promotion of education system.", "title": "Stern action against the teachers who instigate the children against the transfers  says the minister of education"},
{"content": "We are now in front of a promising approach. In the history this type of stories were heard very rarely. This kind of a welfare project is launched for the first time not only in Sri Lanka but for the first time in South Asia.", "title": "“Suraksha” for the perpetual protection of our children…."},
{"content": "The Gazette notification regarding the selection of candidates for following the post Graduate Diploma in Education (internal) –full time course 2018 conducted by the university of Colombo , Peradeniya and Jaffna with the coordination of the National Colleges of Education Branch – Ministry Of Education is scheduled to be published in the Government Gazette of 31st of August 2017.", "title": "Selection of Candidates For Following The Post Graduate Diploma In Education (Internal) full time Course For the Academic Year 2018"},
{"content": "Calling applications for the scholarship program that has been introduced by the ministry of education according to a concept of the minister of education for the gifted children with special talents in sports, arts and new inventions was started on 31st July 2017 and the receiving of applications will end on 06th of September.", "title": "The deadline for receiving applications for the scholarship program that will be offered to the gifted children is 06th September. "},
{"content": "It has been revealed at the preliminary police investigations that the several questions extracted from the second part of the Chemistry paper this time and included in a handout distributed by a person said to be a tuition master in Gampaha area, have been released during the examination is in progress. Accordingly it is very clear that the reports published saying that the same question paper has been released before the examination is totally untrue. The Commissioner General of Examinations Mr. W.M.N.J. Pushpakumara says that it is not necessary to be skeptical about the credibility of the question paper. ", "title": "The questions extracted from the second part of the Chemistry paper and included in a handout have not been released before the examination – disclosed in the preliminary police investigations"},
{"content": "The interviews were held on 28 and 29.08.2017 for the candidates who could not face the interviews since they had to sit for the G.C.E. (A/L) Examination. Therefore the results of those interviews will be published in the official web site of the Ministry of Education (www.moe.gov.lk) on 20.09.2017.", "title": "Recruitment of sports coaches to government schools – 2017"},
{"content": "The Minister of Education AkilaVirajKariyawasam said that the actions will be taken to provide money credited to the central cultural fund through the income received from the selling of entrance tickets to the foreign visitors at Archeological sites, to the temples with preservation and development requirements. The minister stated this while participating in the inaugural function held at the temple trees with the patronage of the Prime Minister Ranil Wickremasinghe yesterday (15) for the distribution of cheques worth of 400 million rupees to 1000 temples for preservation and development works.", "title": "The money received by the Central Cultural Fund from the selling of entrance tickets to the foreign visitors at Archeological sites is to be allocated to the preservation of temples in the island"},
{"content": "The Minister of Education Akila Viraj Kariyawasam took steps yesterday to call for to Colombo all executive officers of the Department of Archeology who are working throughout the island in order to discuss several main issues arisen in the field of Archeology. The attention was drawn to several issues including the problems pertaining to the Archeological sites, issues reported in the print and electronic media, the practical problems faced by the officers while in the field and the restructuring of the Department of Archeology at this discussion that was held at the auditorium of the second stage of Sethsiripaya.", "title": "The Minister of Education summons the officers of Archeology urgently to Colombo"},
{"content": "The Ministry of Education has decided to revise the closing date of the second stage of second school term of all Muslim schools and the opening date of the third term. The allocation of vacation dates for all Muslim schools in the country for the second school term happens in two stages. Accordingly, the vacation had been granted for the first stage of it from 27.05.2017 till 27.06.2017. It had been scheduled to grant vacation for its second stage from (tomorrow) 18.08.2017 till 27.08.2017. But due to the Hajji festival that falls on the 1st of September, a revision of those holidays has been done.", "title": "A change in the closing date of the second stage of second school term of Muslim schools…"},
{"content": "Calling applications was started yesterday for the “Scholarship Program for the Gifted” that has been introduced by the ministry of education for encouraging the students with outstanding talents in the fields of sports, arts and new inventions. This is a concept of The Minister of Education Akila Viraj Kariyawasam and implemented under the budget proposals of 2017. This scholarship program has been implemented with the aim of creating a generation of children with the potential to face the future challenges. It is expected to improve such qualities of the gifted children and to encourage them for maximizing those qualities in order to contribute to the development of the country through this program. These scholarships will be provided under three sections of new inventions, aesthetic activities and sports.", "title": "Calling applications for the “Scholarship Program for the Gifted” introduced for encouraging the students with outstanding talents"},
{"content": "Taking the current disaster situation into consideration, a special media briefing was held at the ministry of education today (31) with the headship of The Minister of Education Akila Viraj Kariyawasam.", "title": "Special Media Briefing to Discuss the Disaster Situation"},
{"content": "Click here to download ", "title": "All Island Western Music & Dance Competition 2017"},
{"content": "Western music and dance competitions of the schools in Western Province scheduled to be held by the Ministry of Education on 02nd June has been postponed until further notice.", "title": "Special Announcement"},
{"content": "Arrangements have been made to hold the written test for the promotions of Sri Lanka Principals’ Service on 02, 05, 06, and 12 of June 2017. The officers, who are unable to participate in this test, please inform to the phone number 0112786252.", "title": "Special Announcement"},
{"content": "The measures are taken through the Department of Examinations to issue certificates of examinations free of charge to replace the destroyed certificates due to the disaster situation.", "title": "Duration for calling applications for G.C.E (O/L) examination is extended until 15th June 2017. The Department of Examinations takes necessary steps to issue certificates of examinations free of charge in place of destroyed certificates."},
{"content": "A special program is being implemented through the Pasdunrata and Ruwanpura colleges of Education of the Ministry of Education to provide cooked food to the disaster affected people. Steps are being taken to supply dry rations necessary for preparing food to those colleges of education.", "title": "Special program for providing relief measures to the disaster affected people through the Pasdunrata and Ruwanpura colleges of Education"},
{"content": "The Ministry of Education will provide textbooks, three sets of uniforms, a pair of shoes and the exercise books to all school children who are affected by the disaster.", "title": "Special program from the Ministry of Education to provide relief measures to the victims of the disaster."},
{"content": "The Minister of Education Akila Viraj Kariyawasam informed at a special media discussion held today that the steps will be taken to close all government schools in Gampaha, Colombo, Kalutara, Ratnapura, Galle, Matara, Hambanthota and Kegalle disaster affected districts for 04 days from tomorrow (30) until Friday (02).", "title": "The Schools in 8 districts will be closed until next Friday due to disaster situation."},
{"content": "The Ministry of Education announces that the National Mathematics and Science Olympiad (Junior) Competitions – 2017 scheduled to be held on 27 and 28 of May 2017 at Siyane National College of Education, Dompe will not be held due to the bad weather conditions.", "title": "Special Announcement"},
{"content": "The minister of Education has decided to give the authority to the principals of the relevant schools to take the decision of closing or opening of the schools in disaster affected areas. The principals have been given the permission to take this decision depending on the risk situations and the effect of the disasters to their schools. The principals have been further instructed to inform about the relevant decision to the Director of National Schools if the school is a national school and to the zonal or provincial director if the school is a provincial school.", "title": "Special Media Communiqué – Authority to decide whether to close or open the schools in disaster affected areas has been given to the principals"},
{"content": "Kaluganthota Piriven awakening educational exhibition – 2018 organized collectively by the Ministry of Education, Pirivena Heads’ Association of Kalutara District and the District Secretariat of Kalutara in parallel to the National Piriven Day is scheduled to be held at the historical Kande Viharaya, Aluthgama.   ", "title": "Kalugamthota Piriven awakening educational exhibition held with the patronage of the Ministry of Education in parallel to the National Piriven Day is at Kande Viharaya, Aluthgama"},
{"content": "“Objective of the Ministry of Education is to make the children of the nation to be passionate with reading” – The Minister of Education Akila Viraj Kariyawasam", "title": "Sustainable Reading Promotional Program ‘Kalana Mithuru Poth Sumithuru’ Is Started – Medals and Foreign Scholarships for Students Who Read Books…"},
{"content": "Based on a concept of the Minister of Education Akila Viraj Kariyawasam the Ministry of Education has taken steps to give an opportunity for expectant teachers who are engaged in teaching and learning process in the school system to come to school wearing a comfortable dress when they come for the duties. It is scheduled to hold its inaugural national program tomorrow (24) under the patronage of the minister at the Ministry of Education.  ", "title": "A new dress code for pregnant teachers"},
{"content": "First school term of Sinhala and Tamil medium government schools and government approved schools will end on Friday the 06th of April 2018 and the second school term will commence on Monday the 23th of April 5 2018.", "title": "Ending of the first school term and commencing of the second school term of the year 2018"},
{"content": "The third school term of government and government approved private schools will end on Friday 08.12.2017 and the first school term of 2018 will be started on Tuesday 02, January 2018. ", "title": "End of the third school term of 2017 and commencement of the first school term of 2018"},
{"content": "December 07th has been named as the National Student Insurance Day to mark the provision of Suraksha student insurance which was introduced at national level on the theme of “Let’s protect our children forever”. Suraksha student insurance is implemented with the aim of safeguarding the physical and mental health of children and to support them to achieve a better future through this scheme. The need for sensitizing the school community including the parents and children about this program and the ways of claiming the benefits of it had been emerged and therefore the ministry of education has made arrangements to make the school children and the school based community aware of this special program on 07th December island wide.", "title": "Commemoration of 'Suraksha' National Student Insurance Day on 7th of December 2017....... Lots of public awareness programms island wide.....  "},
{"content": "The National Youth Orchestra was established in 1992 by the Aesthetic Branch in order to provide all students in the country the opportunity to learn, appreciate and perform Western orchestral music and it has successfully continued to serve its objectives over these many years thus gaining recognition as the flagship project of the Ministry of Education.", "title": "The National Youth orchestra 25th Anniversary Concert 2017"},
{"content": "In the morning today (16) Mr. B. Sanath Pujitha commenced his duties as the acting Commissioner of Examinations. That is to fill the vacancy created as a result of the attachment of former Commissioner General of Examinations Mr. W.M.N.J. Pushpakumar to the ministry of education.", "title": "Mr. B. Sanath Pujitha commences duties as the acting Commissioner of Examinations"},
{"content": "The Deputy Commissioner who worked as the head of the section of confidential and institutional exams of the Department of Examination has been interdicted from today. This has been done because of several complaints of negligence of duties and misappropriation of conduct.", "title": "The head of the section of confidential and institutional exams of the Department of Examination has been interdicted."},
{"content": "A younger brother who participated in the practical test on behalf of his elder brother has been taken into police custody. This was happened while the practical tests are being held at Panagoda army camp in relation to the recruitment of school sports trainers by the ministry of education.", "title": "The younger brother who attended the practical test on behalf of his elder brother has taken into police custody."},
{"content": "According to the memorandum of understanding between Sri Lanka Institution and the ministry of education, the first workshop of Oracle certified “Java Fundamental” training course was held at the computer lab of the Information and Communication Branch from 06.11.2017 to 10.11.2017. Indian national Mr. Srinivas participated as the chief trainer in this program and 25 teachers successfully completed training and they were awarded a certificate as Oracle trainers. Furthermore, the students of those schools have the opportunity to obtain the Oracle certificate after being trained under these teachers.", "title": "The first program of Oracle certified “Java Basics” teacher training course has successfully ended"},
{"content": "Under the instructions of The Minister of Education Akila Viraj Kariyawasam, the air tickets were given recently at the ministry of education to 35 officers who had never been given any foreign training so far in the history of the colleges of education to follow a two weeks training in the Utara University in Malaysia under the capacity building foreign training program.  ", "title": "The provision of foreign training for the officers in teacher educators service begins for the first time in the history of colleges of education…."},
{"content": "The incidents of the participation of school children in protest marches obstructing their education under the misleading influence of some sections have been reported recently and the Minister of Education has instructed the officers to do a special investigation in this regard and submit a report.", "title": "Special investigation under the direction of the minister of education about the participation of school children in protest marches"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that every possible measure will be taken for the welfare of all the teachers in the education system in the country. The minister expressed these ideas while attending the “Guru Prathibha Prabha” 2017 rewards awarding ceremony held today at the BMICH for appreciating the excellent teachers in the teacher service.", "title": "Every possible measure will be taken for the welfare of teachers – The minister of education says at the “Guru Prathibha Prabha” 2017 award ceremony."},
{"content": "A media briefing was held at the Department of Government Information yesterday (04) with the headship of The Minister of Education Akila Viraj Kariyawasam to sensitize the current situation of the Dambulla cave temple.", "title": "A media briefing to sensitize the current situation of Dambulla cave temple"},
{"content": "The necessary instructions for implementing the conservation activities of the frescoes in Dambulla cave temple were given after receiving the information from the incumbent priests of that temple regarding those frescoes in the verge of decaying. Since the UNESCO has warned this temple is in the disadvantaged position of removing from the world heritage list because of the present condition of the temple, he interfered with this matter the minister said. The minister of education further says that some people accuse him as “Bahirawaya” when he interferes in this matter.  ", "title": "The Minister of Education says he is ready to do everything necessary for the protection of heritage of the country"},
{"content": "A special discussion headed by the Secretary of Education was held yesterday (28) at the ministry of education with the representatives of trade unions of principals about the issues emerged in the principals’ service.", "title": "Special discussion on the service issues of the principals"},
{"content": "The Nenasa educational TV channel which was started as a pilot project in 2005 using only 5 schools now has become an official educational TV channel with the official connections with 2250 schools. Nenasa educational TV channel is implemented jointly by the ministry of education and Dialog Asiata Company and telecast 30 minutes lessons covering the syllabuses of Science, Mathematics, Sinhala Language and Literature, English, Geography, History, Information and Communication Technology, Entrepreneurship Studies and Business and Accountancy for G.C.E. (O/L) grades 10 and 11. The video programs providing cocurricular additional knowledge and current affairs educational programs are telecast through Dialog channel number 25 and 26 targeting the school community.", "title": "New memorandum of understanding for Nenasa television channel introducing several new education programs"},
{"content": "It was scheduled to end the receiving of applications for the admissions to the grade one of the government schools for 2018 on 30th June 2017. But the ministry of education has decided to extend the date for receiving those applications till 10th July 2017 considering the demands asking for the extension of the closing date.", "title": "The date of receiving applications for the admissions to the grade one of the government schools in 2018 has been extended till 10.07.2017."},
{"content": "The distribution of special relief package provided by the ministry of education for restarting the educational activities of the school children who were drastically affected by the recent disaster situation was started today (23) with the patronage of The Minister of Education Akila Viraj Kariyawasam.", "title": "The distribution of the relief package consisted of uniforms and textbooks by the ministry of education to the school children affected by the disaster situation are started. Immediate measures to rebuild all damaged school buildings "},
{"content": "First of all I express that these media reports have been published depending on false information.", "title": "In relation to the information published in print media, social media web sites and trade union statements about a teacher subjected to a transfer as a result of writing poems in his own Face Book page"},
{"content": "The “Divaina” newspaper had reported on 11.06.2017 that when printing the grade 7 Geography textbook for 2017 it has created an unhealthy condition for school children by using artificial papers instead of normal papers. Further the Government Medical Officers’ Association also had expressed views on this matter misleading the people. Therefore actions were taken to issue this communiqué.", "title": "Don’t be trapped in the irresponsible statements misleading the parents and children while local and foreign certifications are available accepting grade 7 Geography textbook to be safe and healthful"},
{"content": "Following the instructions of The Minister of Education Akila Viraj Kariyawasam the distribution of laptop computers and Dongals to the Managers of 108 Teacher Centers that have been established to implement the continuous teacher training and 19 Colleges of Education happened yesterday (14) at the auditorium of the ministry of education.", "title": "Laptop computers for 108 Teacher Center Managers and 19 Colleges of Education"},
{"content": "The Minister of Education Akila Viraj Kariyawasam instructed the officers to take necessary steps to fill the teacher vacancies in all national schools and to maintain the administrative and educational activities properly without any obstacle. He instructed further to take immediate actions for balancing the existing teacher cadre in national schools according to the information about the shortages and excesses of teachers in them. The instructions were also given to transfer the teachers who are working in the same national school for a long time and to take necessary measures to appoint the qualified provincial teachers who have been released from the provincial service for the available vacancies in national schools. In addition to this, the minister also mentioned that immediate measures will be taken to solve the problems of teachers with different grades.", "title": "Steps are been taken to fill all teacher vacancies in National Schools within one month"},
{"content": "The Minister of Education Akila Viraj Kariyawasam instructed the officers recently to take necessary actions for issuing a special relief package to restart the educational activities of the school children who suffered from the disaster situation.", "title": "Everything is ready for the distribution of relief package including uniforms and textbooks to the school children affected by the disaster situation"},
{"content": "Professor Prashantha Bandula Mandawala assumed duties recently (06) as the acting Director General of the Department of Archeology. He is a past pupil of the Ananda College, Colombo and has studied in local and foreign universities such as Moratuwa University, York University in England, and Tonhide University in Norway.", "title": "Professor Prashantha Bandula Mandawala takes up duties as the new Director General of the Department of Archeology"},
{"content": "The Minister of Education Akila Viraj Kariyawasam has decided to launch a special program at school level for finding a solution to the problem of garbage which has become a severe issue at the moment. The objective of this new program is to sensitize and practically engage the school community for waste management while socializing the necessary guidance for finding sustainable solutions for garbage problem through the schoolchildren. ", "title": "A special program from The Minister of Education Akila Viraj Kariyawasam to socialize the garbage management as a living habit of school community "},
{"content": "The government has decided to increase the allowance from Rs. 6000.00 up to 10,000.00 paid to the Teacher Assistants serving in the estate schools and the other schools in the island. This has happened as a result of a request made by The Minister of Education Akila Viraj Kariyawasam. This allowance has been increased according to a cabinet approval granted to a request submitted to the cabinet by the minister of education considering the demands made by the teacher assistants and also the current cost of living. It has been decided to pay this allowance to the teacher assistants commencing from the 1st of February 2017.", "title": " A relief from the minister of education to the Teacher Assistants… The allowance for Teacher Assistants is increased up to Rs. 10,000/="},
{"content": "The Minister of Education Akila Viraj Kariyawasam has taken steps to confirm the services of 1660 people who worked as laborers in the Central Cultural Fund.", "title": "The Minister of Education Akila Viraj Kariyawasam has taken steps to confirm the services of 1660 laborers"},
{"content": "Sixteen principals newly appointed last year to the school system and who are leaving the country to participate in a Seminar for Education Administrators from developing countries that will be held in Shanhai, China met The Minister of Education Akila Viraj Kariyawasam yesterday (03).", "title": "16 Principals scheduled to participate in the education officers’ conference in Shanhai, China meet the minister of education."},
{"content": "The International Conference of Young Scientists 2017 was held from 16th to 22nd of April 2017 in Stutgartt, Germany. Sri Lanka participated for the first time at the event as a competitive country. Out of 16 student researches evaluated at the national level, two researches at the international standard were forwarded to the ICYS – 2017. Hence Master Rakindu Wickramaratne, from Nalanda College, Colombo and Master Jude Sajith Jitendran from Mn/ Sithy Vinayagar M.V. Mannar represented Sri Lanka at the event 2017.", "title": "The Achievement of our young Scientists  24th International Conference of Young Scientists (ICYS)  2017"},
{"content": "A Special Workshop entered “International Workshop for the preparation of Standard Education Programs and Modules on Nuclear Energy and Radiation Application for Secondary School” was held from 26th to 30th of March 2017 in Tokyo, Japan.", "title": "International Workshop for the preparation of Standard Education Programs and Modules on Nuclear Energy and Radiation Application for Secondary School"},
{"content": "The first school term in 2017 of the government and government approved private schools will end on 05th Wednesday, April 2017 and the second school term will start on 26th Wednesday, April 2017.", "title": "Ending of the first school term and starting the second school term in the year 2017"},
{"content": "The Minister of Education Akila Viraj Kariyawasam while participating recently (09) in the inaugural function of modernization of the playground of Dharmapala College, Pannipitiya revealed that the excess money collected from the parents for a foreign Karate tournament by the School Karate Association was returned to the parents through the intervention of the ministry of education.", "title": "Excess money collected for sports trips back to the parents – a red light from the minister of education to the sports clubs"},
{"content": "The minister of education says that he is scheduled to leave for Maldives today (09) with the education officers to sign the MOU for providing teacher training in Sri Lanka for Maldivian teachers.", "title": "Teacher training in Sri Lanka for Maldivian teachers – The Minister of Education Akila Viraj Kariyawasam"},
{"content": "The written test for the promotion of the officers recruited to grade iii of the principals’ service in 2009 and 2010 to the grade ii will be held on 02,05,06 and 12 of June 2017 at the ministry of education. The number of candidates applied for this is 1056.", "title": "Promotions of Sri Lanka Principals Service officers"},
{"content": "MBD Group in India has expressed their willingness to donate two classrooms facilitated with digital technical equipments in two schools in Sri Lanka. The official program related to establishing of these classrooms was held recently (06) at the Ministry of Education. This was held under the headship of The Minister of Education Akila Viraj Kariyawasam and with the participation of the Indian delegation including the Chief Executive Officer of the MBD Group Ms. Monika Malhothra.", "title": "A donation of digitl classrooms for two schools from MBD Group in India"},
{"content": "The Minister of Education Akila Viraj Kariyawasam has ordered the officials to submit a detailed report on how marks are allocated in the tests conducted by the schools when the students who have passed the G.C.E. (O/L) from other schools are admitted to their schools and also about the money obtained from those students. This has been done after considering the complaints received on the ways of conducting interviews and obtaining money from the students in some schools. The interviews for admitting students to the advanced level classes are held at school levels and in addition to the results of the examination, achievements they have shown in sports, cocurricular activities and other fields are also considered at these interviews.", "title": "The minister of education orders to call for a report about the methods of admitting children to the popular schools for studying in advanced level. "},
{"content": "The ministry of education has established a Digital Learning Experience Centre to demonstrate new tools and learning methods to the school community through Digital Technology in line with the introduction of computer technology and elearning projects under the directions of The Minister of Education Akila Viraj Kariyawasam in order to empower the school community with new technology including school children and the teachers.", "title": "elearning experience for school children from Digital Learning Experience Centre"},
{"content": "It is also scheduled to open the Vesak paldal made for the first time in India.", "title": "The Minister of Education leaves for India for the inauguration of the Vesak Zone in New Delhi"},
{"content": "We are now celebrating the 2561st Vesak in the year of Buddhist Era. With the objective of celebrating the three auspicious events of the Lord Buddha, Buddhist people in all countries in the world commemorate venerably the Vesak day and it is more significant this time for Sri Lankans. It is a matter of pleasure that the international Vesak celebration and world Buddhist Summit are held in Sri Lanka.", "title": "Wish a glorious Vesak which defeats the mythology by wisdom, the untruth by truth and the ignorance by science!"},
{"content": "The Minister of Education Akila Viraj Kariyawasam expressed his thanks to the teachers and the principals who dedicated for safeguarding the right to education of the children defeating the strike based on the power seeking political aims.", "title": "The teachers and principals report for the service as usual defeating the strike…"},
{"content": "This time, the international Vesak celebration is held in Sri Lanka and at the moment international organizations, government institutions and private institutions are contributing to this activity. The construction of creations generating Buddhist thoughts and depicting the biography of Lord Buddha has already started.", "title": "Special program from the Central Cultural Fund for international Vesak celebrations"},
{"content": "The effort made by some people to darken the future of school children such as the innocent patients were victimized by trade unions in order to achieve narrow political gains of power seeking politicians is thoroughly condemned and any professional who love the country will not join in this socalled protests, said The Minister of Education Akila Viraj Kariyawasam.", "title": "“The protest campaign staged for sabotaging the education of children by power seeking trade unions is condemned; They have nothing but the greed for power” – The Minister of Education Akila Viraj Kariyawasam"},
{"content": "The Minister of Education Akila Viraj Kariyawasam has decided to launch a special program for the promotion of English knowledge of school children.", "title": "A special program from the minister of education for improving the English knowledge of the children"},
{"content": "The new year festival 2017 of the ministry of education that had been named as “Gurugedara Andaheraya” was held yesterday (27) at the premises of the ministry with the paronage of The Minister of Education Akila Viraj Kariyawasam. ", "title": "“Gurugedara Andaheraya” the new year festival of the ministry of education "},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that a revolutionary change in education must be done, if a social and economic development should be brought about in a country and the foundation required for this purpose has already been formulated. Everybody must work together for the future betterment of the children and he is ready to accept humbly all such proposals from intellectuals submitted through any media like letters and Face book messages, the minister says.", "title": "“I am pappy about being able to promote the ministry of education to a prestigious level which had been under continuous criticism in the past”  The Minister of Education Akila Viraj Kariyawasam"},
{"content": "We are celebrating the 69th national independent day this time. We must remember respectfully the service rendered by all communities including Sinhala, Tamil, Muslim, Burger and others for achieving the independence liberating Sri Lanka that had been a colony of imperialists.", "title": "Let’s get ready for an independent future strengthened through conciliation"},
{"content": "The memorandum of understanding for the provision of LKR 300 million by the Republic of India under the small development projects in Sri Lanka, for the construction of a new multiethnic national school in Polonnaruwa district with trilingual education that ensure the national consensus in Kaduruwela area in Polonnaruwa district under the district development project “Awaken Polonnaruwa (2016 – 2020) was signed on 2nd February, 2017. This memorandum of understanding was signed by the Secretary of the Ministry of Education Mr. Sunil Hettiarachchi on behalf of the Republic of Sri Lanka and the Indian High Commissioner in Sri Lanka HE Mr. Taranjit Singh Sandhu on behalf of the Republic of India.", "title": "Construction of a new multiethnic national school in Polonnaruwa district with trilingual education that ensure the national consensus – The signing of MoU between the Republic of India and the Democratic Socialist Republic of Sri Lanka"},
{"content": "The teaching and learning process in the system of education is strengthened by the class of teachers in the country. At present there are two hundred and thirty two thousand five hundred and fifty five teachers serving in 10,162 government schools in Sri Lanka. But still there is a teacher shortage in some schools and specially a teacher excess in urban schools in our country. The Minister of Education Akila Viraj Kariyawasam has drawn his attention to this unhealthy situation that has arisen due to the irregular releases and recruitments happened during the previous regime. ", "title": "The interviews from the second week of February for enrolling new students to the National Colleges of Education"},
{"content": "The textbooks used presently in the elementary Pirivenas have been prepared in 1994 and they have not been updated so far. Drawing attention to this matter, the steps have been taken to update elementary Pirivena textbooks shortly and distribute among the students under the instructions of The Minister of Education Akila Viraj Kariyawasam.", "title": "Steps for updating and publishing the elementary Pirivena textbooks"},
{"content": "The minutes of the Sri Lanka Principals Service number 1185/31 dated 22.10.2014 has been amended for the first time following the directions of the Public Service Commission. According to this amendment, from the activating date of new minutes the officers who are in Grade 1 of the Class 2 of Sri Lanka Principals Service and fulfilled the qualifications to be promoted to the Class 1 of Sri Lanka Principals Service at the date of 01.07.2008 according to the previous minutes, will be absorbed to the Class 1 of the Sri Lanka Principals Service.", "title": "The minutes of the Sri Lanka Principals Service is amended – The officers in the Grade 1 of the Class 2 of Principals Service are absorbed to Grade 1 of Sri Lanka Principals Service"},
{"content": "The Minister of Education Akila Viraj Kariyawasam has given instructions and necessary guidance to the officers to do the Archeological excavations and conservations on a scientific basis obtaining the assistance of modern expertise and technical instruments. Accordingly the Department of Archeology is taking steps to do archeological excavations and to expedite the explorations in the areas where the archeological explorations have not been done yet.", "title": "The largest collection of primitive cave drawings of the island was found in Siyambalanduwa, Monaragala"},
{"content": "The convocation ceremony of the National Institute of Education was held recently (31) at the Bandaranayaka Memorial International Conference Hall. The Prime Minister Ranil Wickramasingha while participating in this ceremony as the chief guest delivered a special lecture on the future endeavours taken to bring about the positive changes in the field of education by the present government.", "title": "Convocation ceremony of the National Institute of Education held under the patronage of the Prime Minister"},
{"content": "The gold award was presented to the creation “Smart Walking Stick” submitted as a group project to the Asia Pacific ICT Awards 2016 representing Sri Lanka by Gagindu Kavinda Bandara and Kavindra Gimhan Wijayawardana of St. Anthony’s College, Kandy and a function was held to appreciate them at the ministry of education under the patronage of The Minister of Education Akila Viraj Kariyawasam yesterday (01). For this competition about 48 creations had been submitted from 16 countries and this creation was selected as the best among them.", "title": "Special appreciation from the minister of education for the students who obtained gold awards at the Asia Pacific ICT Awards 2016"},
{"content": "After the inquiries conducted by the special investigation committee appointed under the instructions of The Minister of Education Akila Viraj Kariyawasam to inquire into the malpractices that are said to have happened in the grade one admissions of 2017 at the Royal College, Colombo, the ministry of education has decided to interdict three officers served in the main interview board and four officers served in the appeal board.", "title": "The officers connected with the malpractices happened in the grade one admissions at the Royal College, Colombo have been interdicted"},
{"content": "The Minister of Education Akila Viraj Kariyawasam instructed the Director General of Archeology Professor Senarath Dissanayaka to take immediate actions to maintain the archeological premises so as to attract the tourists and to reach speedily the expected targets in the work of archeological conservations. He mentioned this while participating in a meeting of the executive officers of the Ministry of Education.", "title": "“Take immediate action to fill the vacancies, if the reason for delay in reaching the required targets is the shortage of staff. Work while sensitizing regularly about the arising practical issues.” The Minister of Education instructs the Director Genera"},
{"content": "The contribution of teachers is significant in the empowerment of the school system in our country. It is essential to engage trained human resource in all schools if we are to strengthen the teaching learning process. Therefore the government has drawn its special attention towards all requirements of teachers such as recruiting teachers to the schools, training, national policy on teacher transfers, grading and promotions of the teachers, teacher salaries and welfare services.", "title": "Several progressive changes in Sri Lanka Teacher Service under the directions of the Minister of education"},
{"content": "The Minister of Education Akila Viraj Kariyawasam instructed the officers to take necessary measures to obtain the services of the teachers qualified in psychocounseling who are capable of solving the problems of students sensitively within the schools because the school children have to face various mental issues in the present complex system of society and it affects negatively on their educational and social existence.", "title": "The Minister of Education instructs the officers to speed up the new recruitments of 2,753 teachers having a formal training in psychocounseling "},
{"content": "Four schools are completely closed to be used as centers for the second stage of evaluation of answer scripts of the G.C.E. Ordinary Level Examination and the parts of remaining 16 schools will be used for evaluation purposes.", "title": "The schools closed for the second stage of evaluation of answer scripts of the Ordinary Level Examination"},
{"content": "The Minister of Education Akila Viraj Kariyawasam said that it was possible to recruit 198 officers to the class iii of Sri Lanka Education Administrative Service with one year orientation training after the period when the Prime Minister Ranil Wickramasingha held the portfolio of the Minister of Education.    ", "title": "After 19 years, 198 new officers are recruited to the class iii of Sri Lanka Education Administrative Service with one year orientation training"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that some people are trying to obstruct and delay the decisions taken for radical changes aimed at quality development of education; because of this it has not been possible to provide students with the studentfriendly modern chairs approved by the doctors. The minister further stated that he will not be frustrated by these actions but take necessary measures to implement the decisions taken for the future benefits of the school children.", "title": "A pilot project of Smart Class Room is commenced"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that his responsibility is to dedicate himself to take actions for ensuring the right to education of all children pursuing education.", "title": "My responsibility is to dedicate for the protection of education right of all children – The Minister of Education Akila Viraj Kariyawasam"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that the steps are being taken to make changes in each and every field according to the rapid changes happening in the world. He said this while participating in the function held for laying the foundation stone to construct a complex for the Public Performance Control Board at the premises of the State Film Corporation, Colombo 07 recently (08). ", "title": "The foundation stone is laid for the construction of a new complex with a digital theatre for Public Performance Control Board"},
{"content": "Year 2017 is a year that introduce a radical change in the education system of this country and it is expected to implement several reforms related to school education during this year, said The Minister of Education Akila Viraj Kariyawasam. He stated this while participating as the chief guest in this year’s national function of school textbook distribution held today (05) at Ananda Sashthralaya, Kotte.", "title": "National function for textbook distribution"},
{"content": "Today, the first working day of the New Year was a special day for the ministry of education. Official duties of the ministry of education were started in the morning today (2) with all religious observances for invoking blessings for the New Year. That was with the leadership of The Minister of Education Akila Viraj Kariyawasam. This function had been organized by the welfare association of the ministry of education.", "title": "The Ministry of Education begins duties in the New Year under the patronage of The Minister of Education Akila Viraj Kariyawasam"},
{"content": "I wish to offer my sincere greetings to all Sri Lankan Christian people on the Christmas Day celebrated at a grand level by Christian devetees all over the world.", "title": "There be a glorious Christmas full of peace"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that the school uniform gift vouchers that were introduced last year will be issued to the school children from today (11) for the year 2017. He stated this while participating in a media briefing held in the ministry today. This time the school uniform gift vouchers are issued under 14 categories and their values will be ranging from Rs.500 to Rs.1700 according to the consideration of present market values.", "title": "School uniform vouchers are issued"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that it is a sad situation when some Provincial Councils are trying to protect the unqualified people neglecting even the cabinet decision to appoint newly recruited principals as principals.", "title": "It is regrettable that some Provincial Councils are attempting to protect unqualified people without appointing the qualified persons  The Minister of Education Akila Viraj Kariyawasam"},
{"content": "Please read more for schools and relevant Cut off marks.", "title": "Cut off marks for grade 5 scholarship examination has released"},
{"content": "Any person or a business institution is totally prohibited from selling school uniform material or promoting them in school premises. Any principal or an officer is also completely prohibited from naming a person or a business institution or taking action to promote any business institution in the process of providing school uniform materials to the children.", "title": "In relation to the distribution of school uniform gift vouchers"},
{"content": "Distribution of computers and computer related accessories to the selected national schools having computer laboratories older than 10 years and depending on the number of students following the subject of Information and Communication Technology was occurred today (30) at the ministry of education under the patronage of The Minister of Education Akila Viraj Kariyawasam.", "title": "Computers and related accessories worth of 75 million rupees are offered to 26 National schools"},
{"content": "The third school term of the year 2016 of the government and government approved Sinhala and Tamil medium schools ends on Friday 02.12.2016.", "title": "The third school vacation will start from 2nd December and they will be reopened on 2nd January"},
{"content": "The Minister of Education Akila Viraj Kariyawasam states that the steps were taken to implement the uniform voucher method with the objective of providing the total sum of money allocated for school uniforms to the children without any wastage when it happened in the past where a lot of corruptions were experienced in the process of school uniform material distribution.", "title": "Uniform voucher method that stopped the corruption and irregularities will not be allowed to anybody for malpractice – The Minister of Education Akila Viraj Kariyawasam"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that the steps have been taken to recruit 5000 sports teachers in order to develop balanced personality of the school children and the priority will be given here to the sports skills in addition to the educational qualifications. The minister expressed these ideas while participating in the inaugural occasion of the “Adhishtana” national sports development program that was started by the Ministry of Education and the Ministry of Sports in collaboration with all Provincial Councils of the country to identify and improve the sports abilities of the school children.", "title": "Priority to the sports skills when the sports teachers are recruited"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that the actions will be taken to prepare education policies aimed at creating a young generation empowered with new information technology skills that suit the world job market. The minister expressed these ideas while participating in the awards and certificates presentation ceremony of the national level information and communication technology champions competitions, held at the auditorium of the ministry of education today (25).", "title": "‘Do not hesitate for reforms that should be done for the promotion of the field of education’ – The Minister of Education Akila Viraj Kariyawasam"},
{"content": "The Dialog Asiata Company in collaboration with the Ministry of Education offers scholarships to the students who obtained highest marks in core subjects at the G.C.E. (Ordinary Level) examination and follow Physical Science (Mathematics) stream at the Advanced Level, with the objective of selecting a best group of students with creative skills and then improve their skills to be used for the development of the country. This is for the improvement of the opportunities in the development of Communication Technology education and the field of engineering.", "title": "An offer of scholarships from Dialog institution for Advanced Level students"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that the steps have been taken to issue a circular preventing the schools collecting money from the parents to give gifts to the teachers, obtaining such gifts and influencing for such activities.", "title": "Laying the foundation stone for a three storey building at the Nakkawatta Mahinda National School, Kuliyapitiya"},
{"content": "A special media discussion was held at the ministry of education today (11) to make all the print and electronic media aware of the allocations made by the government and proposed programs to be implemented utilizing the funds allocated from the 2017 budget proposals for the promotion of education system.", "title": "This time budget is supporting the promotion of education system and full of concessions for children"},
{"content": "The handing over of the air tickets to the students who won the junior championship of the national Mathematics and Science Olympiad Competitions 2016 to go and represent Sri Lanka at the 13th international Mathematics and Science Olympiad competitions that will be held in Indonesia was occurred yesterday (8) at the Temple Trees with the patronage of The Minister of Education Akila Viraj Kariyawasam. ", "title": "Air tickets to Indonesia for the students who won the junior championship of the national Mathematics and Science Olympiad Competitions"},
{"content": "Medals, cups and certificates awarding ceremony of the National Mathematics Olympiad Tournament and the All Island School Mathematics Competitions was held recently (31) at the ministry of education.", "title": "Medals, cups and certificates awarding ceremony of the National Mathematics Olympiad Tournament and the All Island School Mathematics Competitions 2016 "},
{"content": "An expert of the International Center for the Study of the Preservation and Restoration of Cultural Property (ICCROM) affiliated to the UNESCO Mr. Vaner Smith met the Minister of Education Akila Viraj Kariyawasam at the Ministry of Education on 05092016. Mr. Smith is scheduled to provide the expertise of new chemical and scientific methods used in the international level for the purpose of preserving the Sigiri frescoes.", "title": "Assistance of international experts is taken to preserve the Sigiri frescoes on the instructions of the minister"},
{"content": "The Minister of Education Akila Viraj Kariyawasam expressed that the actions will be taken to provide all necessary facilities to the schools without any racial discrimination, not like during the past administration. The minister said this when he participated in the function held at the Darussalam School, Maligawatta, Colombo 10 to lay the foundation for a four storey building in the morning of 01.09.2016. ", "title": "Our responsibility is to be dedicated without any racial discrimination to develop the schools."},
{"content": "There is a clear decrease in the number of complaints recorded this year regarding the G.C.E. Advanced Level Examination and the Grade Five Scholarship Examination in comparison to the previous years. The Department of Examinations had received 402 complaints in 2014 and 152 complaints in 2015 regarding the Advanced Level examination. But the number of complaints received this year is only 48. The complaints regarding the Grade Five Scholarship Examination received by the Department of Examinations also show a remarkable decline this year.", "title": "A remarkable decline in the examination frauds this year – “Take steps to appoint the newly recruited principals also as the examination supervisors in the future” "},
{"content": "The new Secretary of the Ministry of Education Mr. Sunil Hettiarachchi assumed his duties in the morning on 01092016 at an auspicious time. He is a graduate of the University of Colombo and has obtained a Master of Public Administration degree from the Post Graduate Institute of Management and a post graduate diploma on local government from the University of Colombo.", "title": "Mr. Sunil Hettiarachchi assumes duties as the new Secretary of the Ministry of Education"},
{"content": "According to the instructions given by the Minister of Education Akila Viraj Kariyawasam to take immediate measures for settling the long awaited salary arrears and increments, the ministry of education has taken action to release rupees 902.94 million covering 9 provincial councils for settling the teachers’ salary arrears and increments due from 2006.", "title": "Rupees 902 million to pay salary increments and arrears of the teachers from the year 2006 on the instructions of the Minister of Education."},
{"content": "The Minister of Education Akila Viraj Kariyawasam officially declared that the 32nd all island school sports tournament will be started on the 03rd of September. The minister stated this while participating in a media briefing session held recently under the leadership of the minister at the auditorium of the Ministry of Education", "title": "32nd all island school sports tournament will start on 03rd September"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that steps have been taken to create cricket players necessary for a strong national cricket team through school cricket enabling again to win the Cricket World Cup. For that purpose several programs have been prepared to be implemented at the school level according to a long term plan.", "title": "A new plan for popularizing cricket islandwide at school level to create players who can have international victories"},
{"content": "The Sri Lankan children were able to achieve an excellent victory after competing with 622 students of 150 teams of 31 countries in the Tournament of International Mathematics Competition  (TIMC2016) which was held in Chiangmai city of Thailand from 14th August 2016 to 20th August 30, 2016. The significance of this victory was increased because the countries very strong in the subject of Mathematics such as Australia, Canada, China, Singapore, Philippines, India, Malaysia, South Korea, Thailand and Thai van were in this competition. ", "title": "A remarkable victory for Sri Lanka in the Tournament of International Mathematics Competition  (TIMC2016) "},
{"content": "Except the 06 schools used fully as the evaluation centers in the first stage of the G.C.E. (A.L) Examination and 35 schools used for the evaluation activities of the Grade 5 Scholarship Examination, all the other schools will be opened on 31st August 2016.", "title": "All schools except the ones used for evaluation activities of the G.C.E. (A.L) Examination and the Grade 5 Scholarship Examination will be reopened for the third school term on Wednesday 31st of August"},
{"content": "The Minister of Education says that there is a 60000 teacher shortage and 40000 teacher excess in the school system; accordingly actual teacher shortage is 20000. Therefore steps will be taken shortly to change this situation and to get the cabinet approval for an equal distribution of teachers in all schools.", "title": "Cabinet approval for a balance in teacher placements in all schools without any discrimination among National and Provincial schools"},
{"content": "The handing over of the air tickets to the officers and the teachers who represent Sri Lanka at the information and communication technology education program that will be held in South Korea for the ICT teachers and implementing subject directors, was occurred on 22.08.2016 at the Ministry of Education under the patronage of the Minister of Education Akila Viraj Kariyawasam.", "title": "Steps will be taken in the future to increase the number of students from the information technology subject stream when the students are admitted to the Colleges of Education"},
{"content": "The Director General of UNESCO Mrs. Irina Bokova says that on behalf of the UNESCO she is happy about Sri Lanka being in a prominent place in the field of education among the South Asian countries.", "title": "It is a matter to be happy that Sri Lanka is in a prominent place in education among the South Asian countries – The Director General of UNESCO Irina Bokova"},
{"content": "The Director General of UNESCO Mrs. Irina Bokova who has come to Sri Lanka for five day official visit on the invitation of The President Maithreepala Sirisena and The Minister of Education Akila Viraj Kariyawasam visited Sigiriya which belongs to the world heritage zone on 14.08.2016. This is also the first official tour of The Director General of UNESCO Mrs. Irina Bokova to Sri Lanka.", "title": "The Director General of UNESCO tours Sigiriya – The Minister Akila Viraj Kariyawasam also joins the tour"},
{"content": "A delegation including the Director General of UNESCO Mrs. Irina Bokova came to the island today for an official tour. ", "title": "The Director General of UNESCO comes to Sri Lanka…The Minister of Education Akila Viraj Kariyawasam cordially welcomes her at the Bandaranayaka International Airport…"},
{"content": "Several benefits are being received now to the field of education in Sri Lanka as a result of discussions held with various institutions by the Minister of Education Akila Viraj Kariyawasam when he engaged in a successful tour in South Korea during the last month of July.", "title": "Further training in South Korea for 100 Technology teachers"},
{"content": "Since some information on several examination frauds and corruptions happened during the last regime have been revealed, several special programs have been implemented under the instructions of the Minister of Education Akila Viraj Kariyawasam after the present government came into power. ", "title": "“Examination frauds and irregularities happened during the last regime must never be repeated” the Minister of Education instructs the officers"},
{"content": "The Gazette Notification regarding the selection of candidates for following the Post Graduate Diploma in Education (Internal) –Full Time Course 2017 conducted by the universities of Colombo, Peradeniya and Jaffna with the coordination of the National Colleges of Education Branch, Ministry of Education has been published in the Government Gazette of 05th August 2016.", "title": "Selection of Candidates for Following the Post Graduate Diploma In Education (Internal) full time Course for the Academic Year 2017"},
{"content": "The handing over of the air tickets to the students who participate in the international Mathematics tournament that is scheduled to be held in Chiangmai, Thailand from 14 to 20 August 2016 was occurred today (05) at the Ministry of Education under the patronage of the Minister of Education Akila Viraj Kariyawasam.", "title": "Air tickets for the students participating in the international Mathematics competition in Thailand"},
{"content": "Three years have been passed after delivering ethaksalawa to the ownership of the teachers and students and we are proud to note that the Hit counts to ethaksalawa has reached up to 641,529 on 19.07.2016 being the maximum Hit counts in a single day so far.", "title": "ethaksalawa reached the highest hit number on 19072016. Number of hits exceed 6 lakhs.  "},
{"content": "The inaugural function of the last stage of the interschool Milo cup netball tournament was started at the Matara Uyanwatta stadium recently (July 30) under the patronage of the Minister of Education Akila Viraj Kariyawasam. ", "title": "The last stage of the interschool Milo cup netball tournament under the patronage of the Minister of Education"},
{"content": "The measures have been taken to implement the programs for empowering school information and communication technology societies in order to sensitize the student community and the entire school system about the new knowledge and invention opportunities of the information and communication technology in the operation of creating a Sri Lanka empowered with the digital technology. Inauguration program of this was held on 26 and 27 of July 2016 covering the Polonnaruwa and Anuradhapura districts in the North Central Province as mentioned below.", "title": "Dawn on the way to a novel future arising with the digital technology"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that the steps will be taken shortly to appoint new principals with grades to fill the vacancies in the schools without principals with grades. For this purpose steps will be taken to obtain the approval of the cabinet while taking the support of all the Provincial Councils and the Provincial Public Service Commissions.", "title": "Steps will be taken to appoint new principals with grades to the schools not having the principals with grades"},
{"content": "The discussions were held at this occasion on the long term plans that should be done in the field of education looking at the future till 2030 and to suite for that and also considering the innovations necessary for the field of education to be successful in the modern world.", "title": "UNESCO assists to make the South Asian Teacher Development Center situated at Meepe to be a Central Teacher Training Institution in the region"},
{"content": "Based on the results of the competitive examination and the interview conducted in 2015 for the recruitments to the Grade 3 of the Sri Lanka Principals’ Service, 3858 principals have been selected. Among them 780 officers from the Western Province, 583 officers from the Central Province, 536 officers from the Southern Province, 435 officers from the North Western Province, 396 officers from the Northern Province, 349 officers from the Eastern Province, 267 officers from the North Central Province, 260 officers from the Sabaragamuwa Province and 252 officers from the Uva Province have been qualified for this.", "title": "Appointments for the principals who were qualified for the grade 3 of the Sri Lanka Principals’ Service"},
{"content": "The Minister of Education stated that the new government allocated a large amount of money after coming into power and those funds have been directed to the school system while identifying the priorities under the proper management and correct criteria. The minister said this on 11.06.2016 while participating in the “Diri Daru Harasara” grade five scholarships awarding ceremony organized by the Ministry of National Policy and Economic Affairs. The minister further mentioned at this occasion that the government has already taken several steps to support the education for upgrading the human capital.", "title": "The government has already taken several steps to promote education for upgrading the human capital"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that the steps will be taken to introduce the mediation process to the school system also with the help of the Ministry of Justice. The minister stated these ideas while participating in the district mediation board conference in Kurunegala today.", "title": "We will take action to educate school children on mediation process with the support of the ministry of justice "},
{"content": "The ministry of education has taken steps to implement a series of special programs with the intention of creating a most suitable environment for education through a better social background, healthy mind and body. Accordingly the ministry of education has named the month of June from 1st to 30th as the “Month of School Children Protection” and a series of various programs have been planned in relation to the protection of children within the school premises and as well as outside of the school.", "title": "It is the duty of everybody to protect the children our greatest treasure"},
{"content": "In order to commemorate the World Environment Day which falls on 05th June, the arrangements have been made to declare the week from 30th May to 05th June as the National Environment Week and to carry out special environmental protection programs in collaboration with all state and private institutions during the National Environment Week. ", "title": "Tree planting and Sramadana campaigns at all schools in parallel to the World Environment Day"},
{"content": "The first South Asian Conference on sustainable peace and education was held by the UNESCO institution in collaboration with the Sri Lankan Government at the Hilton Hotel on 27.05.2016 with the patronage of the Minister of Education Akila Viraj Kariyawasam.", "title": "Initiating access for social cohesion, peace and understanding can be provided through quality education "},
{"content": "Under the special disaster relief program organized by the ministry of education for the school children affected by the recent bad weather conditions, the first stage of sending school uniforms, textbooks and exercise books necessary for the children to the provincial and zonal offices started on 26.05.2016 at the book stores complex at Pitipana, Homagama under the patronage of The Minister of Education Akila Viraj Kariyawasdam.", "title": "The first stage of distributing uniforms and textbooks necessary for affected children starts"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that if everybody gets together, thinks innovatively and works dedicatedly the country can be developed very soon. ", "title": "“Rapid development can be achieved if everyone thinks anew and works together\""},
{"content": "The Tower Hall Foundation has taken actions to produce and present the Ramayana Nurthi by the Lawyer John De Silva and the Director General of the Tower Hall Foundation Mr. Lionel Fernando handed over the compact disc containing the popular songs of that drama to the Minister of Education Akila Viraj Kariyawasam today (13) at the ministry of education. ", "title": "The compact CD containing popular songs of “The Ramayana Nurthi” by John De Silva, Attorney at Law is presented to the Minister of Education "},
{"content": "The minister stated this while attending the function for awarding appointment letters to 207 new Pirivena teachers appointed recently to the system of Pirivena education (124 – clergy and 83 – lay) held on 12.07.2016 at the auditorium of the ministry.", "title": "Measures will be taken to amend the outdated acts related to the field of education."},
{"content": "An amendment has been done in several sentences of the circular issued this year for school admissions in 2017 which had prevented the old pupils participating in interview boards, appeal boards and protest review boards.", "title": "An Amendment"},
{"content": "The Central Cultural Fund has started a special five year research project in order to search for the archeological sites in Polonnaruwa which has a greater historical value that should be preserved and significant for the field of tourism. The first year report including the information about the identified areas through the excavations done under this project was handed over to the Minister of Education Akila Viraj Kariyawasam by Professor Robin Cunningham of the Durham University, England. ", "title": "The report on the latest archeological findings at Polonnaruwa is presented to The Minister of Education Akila Viraj Kariyawasam"},
{"content": "More than 19,000 candidates sat for the competitive examination held in 2015 to fill 4431 vacancies in Grade 3 of the Sri Lanka Principals’ Service. A structured interview was held for 4079 people who passed the examination and based on the results of it, 3859 officers were appointed to Grade 3 of the Sri Lanka Principals’ Service.", "title": "3859 officers for Grade 3 of the Principals’ Service; Orientation training is on 09th May"},
{"content": "Handing over of 1000 bicycles donated by the Arai Shoji Company Ltd in Japan on the request of The Minister of Education Akila Viraj Kariyawasam, to the children of low income families in difficult areas and not having parental protection took place yesterday (03). Symbolizing this, ten school children were given bicycles at the ministry of education premises. ", "title": "On the request of Hon.Minister 1000 bicycles from Japan for the children in difficult areas"},
{"content": "Under the instructions of the Minister of Education Akila Viraj Kariyawasam, the Ministry of Education has taken action to obtain recommendations from several institutions including the meteorological department, Ministry of Health and Disaster Management Center on how the prevailing extremely hot weather condition affects the schoolchildren. ", "title": "No change in school timetable though there is hot weather condition"},
{"content": "The Ministry of Education has taken steps to strengthen the school computer network providing a supportive teaching learning base for the general education system. Accordingly the Information and Communication Technology Branch of the Ministry of Education will activate this new school computer network. The measures are being taken to be migrated all the uploaded content in the SchoolNET into the Lanka Government Cloud of the Information and Communication Technology Agency (ICTA) from 01.07.2016. It is possible through this to log into eThaksalawa eLearning portal created by the Ministry of Education as the Learning Management System for general education.", "title": "The School Computer Network ‘SchoolNET’ with a new look … Hot Line – 1975"},
{"content": "A number of incidents about the breach of discipline by the players of school rugby were reported recently. It is also observed that some outside parties also interfering in such incidents. Incidents such as assaulting, injuring, destroying property and also assaulting the teachers at these occasions were continuously revealed through the media. ", "title": "Several Tough Decisions to Maintain the Discipline in the Sport of School Rugby"},
{"content": "Awards and honours presentation ceremony of 2014 all island school drama competition organized for the 24th time by the Ministry of Cultural and Aesthetic Affairs in collaboration with the Ministry of Education and Tower Hall Foundation was held recently (28) with the patronage of the honourable minister of education.", "title": "Arts can do a lot to release people from monotonous lives"},
{"content": "The arrangements have been made to implement the first stage of the program in which the national school principals selected through the school quality index sending for foreign training, in Malaysia and Thailand from 1st to 12th May.  A team of 25 principals and 05 education officers selected for this purpose is scheduled to leave for Malaysia and Thailand. The handing over of the air tickets for this journey was held at the premises of the Ministry of Education under the leadership of The Minister of Education Akila Viraj Kariyawasam on 29.04.2016. ", "title": "The principals selected through quality indicators of the schools for foreign training"},
{"content": "Marathon race of men and women, singing of folk songs, pillow fighting and the greasy post were significant events of the festival which was held including a number of competitive events. A large number of officers of the ministry participated in this festival and the tug of war event of men and women was an attraction of everybody. Building section was the winner of men’s tug of war competition which was held with several rounds.", "title": "“Isuru” New Year festival is held in a grand scale"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that a cabinet paper will be submitted in the future to provide the Rs.10,000 salary increment to the teacher assistants also and as soon as the new government came into power, the salary of the public officers was increased by Rs.10,000. The minister stated this yesterday (27) while participating in the event of presenting appointment letters to 455 teacher assistants of estate schools at the auditorium of the Ministry of Education.", "title": "Steps will be taken to provide Rs. 10,000 salary increment also to the teacher assistants in the estate schools"},
{"content": "The committee on political victimization had received nearly 11,000 complaints from the people who had been discriminated within the field of education on the basis of political grounds or otherwise during the period from 1995 to 2015. ", "title": "Nobody has been discriminated in the enrolling process to the National Colleges of Education"},
{"content": "The political victimization committee had received nearly 11,000 complaints from the people who had been politically or otherwise victimized in the field of education during the period from the year 1994 to 2015. A formal investigation about the basic facts of these complaints was conducted by a committee comprised of the senior executive officers of the ministry of education. Further investigations about the relevant information were done by the ministry of public administration and for nearly 4600 individuals selected through this process; the cabinet approval has also been obtained to give compensation.", "title": "No promotions or reliefs to any unqualified person on the recommendations of the political victimization committee "},
{"content": "The Ministry of Education has taken steps to provide an additional set of uniforms for the requirements of the students studying in difficult, most difficult and remote schools in the middle of the year. ", "title": "Additional uniforms for the students in difficult, most difficult and remote schools in the middle of the year"},
{"content": "Parents/ Legal Guardians who expect to admit their children to Grade One in schools in year 2017 should forward their applications prepared in conformity with the specimen form and according to the instructions given in this notification addressed to the relevant Heads of Schools by registered post to reach them before 30th June 2016.", "title": "Instructions related to the admission of children to Grade One In Government Schools for the Year 2017"},
{"content": "Accordingly the university students are ready to photocopy their individual note books and other subject related documents that they used for their advanced level and give them to the affected students.", "title": "The University of Colombo has joined hands with the Ministry of Education to Provide photocopied note books in place of destroyed note books of Advanced Level students"},
{"content": "The Minister of Education Akila Viraj Kariyawasam has instructed the officers to allow the children in disaster affected areas to wear any suitable dress instead of uniforms when they come to schools until the prevailing disastrous situation is ceased. ", "title": "Uniforms are not compulsory, allow children to come to school wearing any suitable dress – The Minister of Education Akila Viraj Kariyawasam"},
{"content": "The Minister of Education Akila Viraj Kariyawasam instructed the Commissioner General of Examinations to take immediate measures to issue the relevant certificates to the people whose certificates of examinations have been destroyed due to disastrous situation with the prevailing weather condition.", "title": "Take immediate measures to issue the certificates of examinations that have been destroyed by the disaster – Instructions to the officers from the Minister of education – “Don’t raise any issue on obtaining the certificates again”"},
{"content": "It is a pleasure that the people in foreign countries also have already joined with the ministry of education to make this good deed a success which is implemented for the school children who are struggling to overcome innumerable sufferings caused by the prevailing bad weather condition.", "title": "A lot of relief aid to the special disaster relief management cell set up in the Ministry of Education for providing relief assistance to the affected children"},
{"content": "This was announced by Hon. Akila Viraj Kariyawasam, Minister of Education on the special press conference held today.", "title": "Announcement 20th as school holiday due to bad weather"},
{"content": "The Minister of Education Akila Viraj Kariyawasam instructed the relevant officers to pass the responsibility of taking decisions about holding schools during the prevailing bad weather condition to the Provincial and Zonal Directors of Education.", "title": "The instructions from the minister of education to the officials about the measures to be taken when holding schools during the prevailing bad weather condition"},
{"content": "The New Inventors Competition was held in 2014 at school, zonal, provincial and national levels by the Ministry of Education in collaboration with the Sri Lanka New Inventors’ Commission. The student A.G.N.D. Wickramaratna of the D.B. Wijethunga National School in the Central Province was able to obtain the national level first place by creating a special coffee plucking machine for that competition.     ", "title": "An award from the Minister of Education for the student who obtained the first place in the new inventions competition in 2014"},
{"content": "When the correct decisions are taken in the system of education, the assistance of local and foreign experts is always sought and despite whatever the criticisms, such correct decisions are not withdrawn, says The Minister of Education Akila Viraj Kariyawasam.", "title": "Correct path cannot be interrupted by criticisms"},
{"content": "Handing over of the necessary air tickets to three students who are representing Sri Lanka at the International Science and Engineering Exhibition was occurred today under the patronage of ?he Minister of Education Akila Viraj Kariyawasam. ", "title": "Air tickets are presented to the students participating in the International Science and Engineering Exhibition – 2016"},
{"content": " ", "title": "Mr. Thissa Hewavithana takes up duties as the Secretary of the State Ministry of Education"},
{"content": "Mrs. Susila Kuragama had been ill and hospitalized for some time and her family members found it difficult to pay even the hospital bills due to economic hardships.", "title": "The Minister of Education Akila Viraj Kariyawasam pays his last respects to the remains of late Mrs. Susila Kuragama–Presents one hundred thousand rupees also to bear the expenses including hospital bills. "},
{"content": "Provision of 11 multimedia projectors and screens to be used in awareness programs on Pirivena administration affairs and the training of Pirivena teachers was occurred at the auditorium of the Pirivena Branch of the Ministry of Education on 03.02.2016. These were handed over to 11 Provincial Assistant Directors of Education (Pirivenas) Priests by the Educational Consultant (Pirivenas) Reverend Deewala Mahinda Thera.", "title": "Multimedia Projectors to Facilitate Pirivena Education and Administration"},
{"content": "The Minister Akila Viraj Kariyawasam says that the new government is always dedicated to uplift the art, artists and the culture of the country and seek always the views and suggestions of senior artists for this purpose. ", "title": "The Views and Suggestions of Senior Artists Are Frequently Sought to Promote Local Art and Culture "},
{"content": "A blood donation program organized for the tenth term by the sports club and the welfare society of the ministry of education was held on 03032016 at the ground floor of the ministry. The staff of the ministry including the Minister of Education Akila Viraj Kariyawasam, the State Minister of Education V. Radhakrishna, The Secretary of the Ministry of Education Mr. W.M. Bandusena, additional secretaries and the sectional heads participated in this occasion.   ", "title": "Blood donation by the staff of the Ministry of Education"},
{"content": "Although some people accuse without any understanding about the new recruitments, so far any illegal appointment has not been made, The Minister of Education, Attorney at Law AkilaVirajKariyawasam says. He has not taken any step to give appointments without due transparency even though as politicians they have to draw attention to the expectations of people especially to the unemployment problem of the people. If the wrong decisions are taken especially in the field of Archeology and Culture, the damage is made to the history and culture of the country, the minister emphasized. ", "title": "It is the responsibility of our ministry to appoint suitable people without any political discrimination for the development of the field"},
{"content": "The steps will be taken to establish a fund that can support the health requirements of the senior artists says the Minister of Education Akila Viraj Kariyawasam.", "title": "A fund will be established to support the health requirements of the senior artists"},
{"content": "The first term of all Sinhala and Tamil government schools and the government approved private schools will end on Friday, 8th of April 2016 and they will be reopened for the second term on Monday, 25th  of April 2016.", "title": "Ending the first school term and starting the second school term in 2016"},
{"content": "The commissioner of national colleges of education has taken action to send the list of qualified candidates to be admitted to 19 national colleges of education, selected from among the students who sat for the G.C.E. (Advanced Level) Examination in 2013 to all the presidents of the national colleges of education on Friday, 1st of April 2016. Accordingly, those presidents of the national colleges of education have planned to send the calling letters tomorrow (05) to admit the qualified candidates. It has been scheduled to start the registration of students from 20th April and is hoped to commence the courses from the first week of May.", "title": "Steps are being taken to finalize the intake of new students to the national colleges of education in the month of April; also new plans to develop the National Colleges of Education "},
{"content": "Rajakeeya Panditha Professor Reverend Nambiriththankadawara Ghanarathana Thera resumed the duties today (28.03.2016) of the post of Director of Pirivena Education which has been vacant for three years. ", "title": "Professor Reverend Nambiriththankadawara Ghanarathana Thera to the post of Director of Pirivena Education"},
{"content": "National Function for Grade One Admissions in Schools was held today (14) at Janadhipathi Vidyalaya, Rajagiriya.", "title": "National Function for Grade One Admissions in Schools in 2016 under the Patronage of the Minister of Education"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that his aim is not to enjoy the status of minister but to exert himself to do something for the country.", "title": "Our aim is to do good for the country through the post of minister"},
{"content": "The direct attention of The Minister of Education Akila Viraj Kariyawasam was drawn after taking into consideration the ideas of the students and parents for the purpose of providing more opportunities for maximum number of grade five scholarship holders to be admitted to popular schools. Accordingly, the minister directed the ministry officials to look into this matter and it was revealed through these inspections that there are possibilities in some popular schools to expand the situations for more admissions of grade five scholarship holders.", "title": "The doors of popular schools were opened for grade five scholarship holders with the interference of The Minister of Education."},
{"content": "Planting of trees occurred to mark the occasion of the first anniversary of the appointment of Mr. Mithreepala Sirisena as the president of the country, under the patronage of The Minister of Education Akila Viraj Kariyawasam. This had been organized on 08012016 at the ministry premises and several senior officials including the Secretary of Education Mr. W.M. Bandusena participated in this occasion.", "title": "Tree planting to mark the first anniversary of The President"},
{"content": "The bookshop maintained by the Department of Education Publications came under instant supervision of The Minister of Education Akila Viraj Kariyawasam.", "title": "The bookshop of the Department of Education Publications is under the minister’s instant supervision"},
{"content": "The Minister of Education says that the government has a clear responsibility to provide good quality books and to generate the reading habits among the children. The minister expressed these ideas while attending the national function for the distribution of school textbooks for 2016 at The Ananda College, Colombo in the morning of 05.01.2016. ", "title": "The government has a clear responsibility to provide good quality books and to generate the reading habits among the children "},
{"content": "The Minister of Education Akila Viraj Kariyawasam visited Sigiriya recently (02) to inspect the plaster layer of the upper part of the cave containing the frescoes which collapsed recently.", "title": "Instructions from the Minister of Education to seek local and foreign assistance to preserve Sigiri frescoes"},
{"content": "A function had been organized today (01) at the premises of the ministry of education to commence its work in the New Year 2016. The State Minister of Education V. Radhakrishnan, Secretary of Education Mr. W.M. Bandusena and several senior officials of the ministry participated in this official function that was held under the patronage of The Minister of Education Akila Viraj Kariyawasam. ", "title": "The Ministry of Education commences its work in the new year 2016 under the leadership of the Minister of Education"},
{"content": "Sri Lankan students were able to bring outstanding victory for Sri Lanka, competing with 202 students in the Mathematics section from 20 countries at the International Mathematics and Science Olympiad Competitions (IMSO – 2015) which was held at Pathumthani city in Thailand from 1st November 7th November 2015. The significance of the victory is highlighted since the countries reputed for strong achievements in the Mathematics subject such as China, Singapore, South Korea, Philippines, India, Malaysia and Thailand were among the competitors.", "title": "Outstanding victory for Sri Lanka at the International Mathematics and Science Olympiad Competitions (IMSO) – 2015"},
{"content": "The Ministry of Education has announced that 12.11.2015 is declared as a holiday for Pirivenas in the Western Province since the cremation ceremony of venerable Maduluwawe Sobhitha Nayaka Thera is held on that day and on 28th November a cover up session will be held.", "title": "Holiday on 12.11.2015 for Pirivenas in the Western Province on account of the cremation ceremony of venerable Maduluwawe Sobhitha Nayaka Thera"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that he is not ready to achieve political advantages through showing the results of education with short tactics but he will make necessary changes in the field of education, looking at the future of education for about 30 or 50 years ahead with a clear vision. ", "title": "Changes necessary for long term development of education will be done with a clear vision "},
{"content": "“Although there are 109 teacher centers in the island constructed for the purpose of training the teachers, they have become inactive now; they will be modernized and activated properly to be active teacher centers within one year” says The Minister of Education Akila Wraj Kariyawasam. ", "title": "All the teacher training centers will be activated within one year"},
{"content": "The students who obtain more than 35 marks for each paper and the total marks exceeding 70 out of 200 at the grade 5 scholarship examination will be considered as pass the scholarship examination and they will be awarded certificates. This time 333,672 students sat for the examination and 254,690 students passed the examination making the percentage of it as 76.33%. All these students will be confirmed as passed the examination and the arrangements are being made to issue 254,690 certificates to all the schools. This is an appreciation for the students. If the cut off mark is considered as the pass mark, only 31,853 students will be considered as passed the examination and it will be unfair for the students.", "title": "Pass marks and the cut off marks of the scholarship examination"},
{"content": "Many unnecessary issues have been penetrated into education as a result of misuse of political interference with education during the last regime, therefore in any circumstances it is not intended to do any political interference with education, he has only a thirst of making identified changes in education looking at the future of 30 or 50 years ahead, says The Minister of Education Akila Viraj Kariyawasam.  ", "title": "Politics will not be mingled with education in any circumstances"},
{"content": "The Minister of Education Hon. Akila Viraj Kariyawasam states that it is expected to do a tremendous change in education system by implementing necessary policy decisions after identifying the changes that should be done in the field with understanding and responsibility. The steps will be taken to provide all the facilities available in Colombo schools to the village level, especially under the concept of making the nearest school the best school and also the local and foreign trainings will be given to the teachers and the principals. ", "title": "A Tremendous Change in Education Will be Done Shortly with Understanding and Responsibility"},
{"content": "The ministry of education conducted a competitive examination for the recruitment of western music teachers that has been a considerable shortage in the schools of the island.", "title": "Recruitment of Western Music Teachers  2015"},
{"content": "On this day when Christians the world over celebrate with great solemnity this festival of Christmas, it is time opportune for us to make this world a safe and better place for the children who are born daily in our midst.", "title": "Christmas Message from Hon. Minister of Education"},
{"content": "Dr. A.T. Ariyarathna, the founder of Sarvodaya and famous social activist met The Minister of Education Akila Viraj Kariyawasam on 22.12.2015 and Mrs. Rupa Saparamadu a daughter of Martin Wickaramasingha the famous writher also joined. ", "title": "Dr. A.T. Ariyarathna, founder of Sarvodaya meets The Minister of Education."},
{"content": "The arrangements have been made by the information and communication technology branch of the Ministry of Education in collaboration with the University of Vocational Technology to provide the following degree opportunities based on the information and communication technology education for the teachers who teach the subject of ICT.", "title": "Degree Opportunities Based on the Information and Communication Technology Education 2016"},
{"content": "Cut off marks of the Grade 5 scholarship examination2015 has released.", "title": "Cut off marks of the Grade 5 scholarship examination has released."},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that it is scheduled to be implemented a series of significant changes in school education system shortly on the basis of policy decisions taken by a committee headed by Hon. Prime Minister. ", "title": "A series of significant changes in school education system shortly – Higher education opportunities again for the school leavers as failures at G.C.E. (O/L), Continuous education for each child from grade 1 to 13"},
{"content": "The Minister of Education Akila Viraj Kariyawasam states that immediate steps will be taken to solve the vocational problems of all librarians and through that, necessary background required for active maintenance of all the libraries in Sri Lanka will be created. ", "title": "Urgent steps will be taken to solve the vocational problems of all librarians "},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that during this Christmas we will determine to create a nation full of knowledge and compassion. The minister stated this while attending as the chief guest of the Christmas celebration organized by the staff of the ministry at the auditorium of the ministry of education on 10.12.2015. The minister also extended his greetings to all Christian devotees for a happy and peaceful Christmas.", "title": "During this Christmas we will determine to create a nation full of knowledge and compassion"},
{"content": "The minister stated this while attending a get together organized by a group of principals who had returned after successfully completing a foreign training program in Thailand.", "title": "Foreign training opportunities for principals and teachers are expanded"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that the system of uniform gift voucher scheme is ninety five percent successful. ", "title": "The system of uniform gift voucher scheme is 95% successful"},
{"content": "The third school term of all government Sinhala and Tamil schools, government approved private schools and Muslim schools will end on 4th Friday, December 2015 and the first school term of 2016 will be started on 4th Monday, January 2016.", "title": "Close of third school term in 2015 and starting the first school term in 2016"},
{"content": "The gazette notification for the Selection of Teachers to Follow Teacher Training Courses at Teachers’ Colleges 2016/2017 was published in the government gazette on 27.11.2015 and the last date for receiving applications is 28.12.2015.", "title": "Selection of Teachers to Follow Teacher Training Courses at Teachers’ Colleges 2016/2017"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that basic arrangements of the new program to distribute gift certificates from 2016 instead of school uniform material have been already finalized with the sole intention of giving all the benefits of education directly to the children and all the measures have been taken to distribute gift certificates for purchasing the uniform material among all the school children before Friday (4th December).", "title": "All the arrangements have been made to distribute gift certificates for school uniform material before 4th December"},
{"content": "The Minister of Education Akila Viraj Kariyawasam states that he will never be hesitated to take firm and correct decisions for the future of the education in the country and his intention is to provide full amount of money allocated by the government for the education directly to the benefit of children. ", "title": "Never be hesitated to take firm and correct decisions for the future of the education in the country"},
{"content": "The International Mathematics and Science Olympiad Competitions (junior) 2015 were held at Pethumthani, Thailand from 01.11.2015 to 07.11.2015. ", "title": "Congratulations from Mother Lanka to the Students who Became champions with Gold, Silver and Bronze at the Science Olympiad Competitions"},
{"content": "The Minister of Education Akila Viraj Kariyawasam says that in the process of the new program to provide gift certificates (vouchers) instead of uniforms material, action should be taken not to recurrent business mafia at the low level that happened at the high levels previously. His intention is to provide direct benefits of education to forty three hundred thousand school children of this country. For this purpose all the provincial and zonal heads and all the principals must extend their collective support with positive intentions, the minister further stated.", "title": "The new program to provide gift certificates (vouchers) instead of uniforms material is launched"},
{"content": "Award Ceremony of National Level Information Technology School Champions Competitions held jointly for the seventh time by the Information and Communication Technology Branch of the Ministry of Education, Sri Lanka Information Technology Industrial Board (FITIS) and Computer Society of Sri Lanka (CSSL) was held at the auditorium of the ministry of education on 24.11.2015 under the Patronage of the Minister of Education Akila Viraj Kariyawasam and with the participation of distinguished guests including the secretary of education Mr. W.M.  Bandusena,  additional secretary (school affairs) Mr. A.S. Hewage,  the director in charge of Information and Communication Technology Mr. G.M. Neil Gunadasa, The chairperson of Sri Lanka Information Technology Industrial Board Mr. Chinthaka Wijewikrama, vice chairperson of the Computer Society of Sri Lanka Mr. Yasas Abeywikrama, Professor of the Computer School of the University of Colombo (UCSC) Gihan Wikramanayaka and the principals, teachers, award recipients and  some representations from the government and private sectors. ", "title": "Award Ceremony of the Seventh National ICT School Champions under the Patronage of the Minister of Education….."},
{"content": "The memorandum of understanding signed on 24.10.2005 between GMOE (Gwangju Metropolitan Office of Education) of the Republic of South Korea and the Ministry of Education, Sri Lanka has been maintained continuously with some occasional renewals. Accordingly, this MoU between Gwangju Metropolitan Office of Education and the Ministry of Education was renewed and signed again on 25th June 2014 for another five years period.", "title": "Official Tour of the Officers from the Department of Education, South Korea"},
{"content": "Honorable State Minister of Education V. Radhakrishnan declared opened The Information and Communication Technology Education Center of the Northern Province at Muruthampalai, Vavunia on 12.11.2015.", "title": "The Information and Communication Technology Education Center of the Northern Province was Opened"},
{"content": "The Ministry of Education has been continuously providing free school uniform material for about 4.2 million students in nearly 10,000 public and affiliated private schools since 1993 and about 2,300 million rupees were allocated annually for this purpose.  ", "title": "A Cash Voucher instead of Uniform Material for School Children from 2016"},
{"content": "The Minister of Education Akila Viraj Kariyawasam, Attorney at Law and the Hon. Chairperson of the Sri Lanka National Commission for UNESCO who contested representing Sri Lanka for the Executive Committee of the UNESCO General Assembly which was held at the UNESCO headquarters in Paris, France was selected to the Executive Committee receiving 149 votes that was more than 80% from member states.  ", "title": "The Minister of Education Akila Viraj Kariyawasam has been appointed with a Remarkable Majority to represent Sri Lanka at the Executive Committee of the UNESCO General Assembly "},
{"content": "All the Sinhala and Tamil schools except  8 schools fully reserved for paper marking of G.C.E. (Advanced Level) Examination and 21 schools of Grade Five Scholarship Examination will be reopened on 31.08.2015 for the third school term.", "title": "G.C.E. (Advanced Level) Examination and Grade Five Scholarship Examination 2015 – Arrangement for marking the answer scripts"},
{"content": "A team of teachers and officers participates annually in information and communication technology education program held in South Korea according to the provisions in the memorandum of understanding between the Ministry of Education Sri Lanka and Gwangju Metropolitan Education Department in South Korea. Two teachers from each Province who have shown an outstanding performance in the field of information and communication technology and provide service as resource persons in the programs organized by the Ministry of Education have been selected for this team. In addition to this, the teacher who came first in the creative teacher section of the national information and communication technology champions competitions, making it a team of 19 teachers and three officers will participate in this program.", "title": "Air tickets are handed over to the team participating in Information and Communication Technology education program held in South Korea in 2015"},
{"content": "Ministry of Education official website www.moe.gov.lk honoured with Bronze Award at best Sinhala web category in the BestWeb.lk competition organized by the lk domain registry. ", "title": "Ministry of Education official web site www.moe.gov.lk awarded in the BestWeb.lk competition "},
{"content": "The order issued banning the organizing tuition classes, lectures, seminars and workshops for grade 5 scholarships examination 5 days prior to the commencing of the examination has been revised to be 3 days prior to the commencing of the examination on the instructions of the minister of education.", "title": "Organizing tuition classes, lectures, seminars and workshops for grade 5 scholarships examination"},
{"content": "The results of the efficiency bar test held on 22.03.2015 have been published in the official web site of the ministry of education. Arrangements have also been made to send these results to relevant candidates by post within next week.", "title": " Efficiency bar tests of Sri Lanka Principals’ Service are in due course"},
{"content": "Under this program, it is expected to conduct courses for school leavers in relation to Agriculture, Apparel Technology, Host Management, Mass Communication, Information and Communication Technology and Business Process Outsourcing (IT BPO). Ten centers have been selected throughout the island for the pilot project. Teaching staff of these centers has already trained and all the centers have been supervised.", "title": "The industrialists are made aware of the information technology courses based on industries"},
{"content": "Nearly 75% of the integration activities of more than 225,000 teachers in the island,performed according to the new teacher service minute have been finalized. Integration activities and the promotions of 15,600 national school teachers out of the total number 32,000, according to the new service minute, have been completed and it was also possible to give promotions to 65% of provincial school teachers. The ministry of education has informed the provincial directors of education to complete all the other integration activities and the promotions before 31st August, 2015.", "title": "Promotions for 15,600 national school teachers according to new teacher service minute"},
{"content": "Sri Lankan students were successful to bring honour to the country by competing with 608 students in 151 groups from 29 countries in the 16th International Mathematics Competition (IMC – 2015) which was held in Changchung city in China from 27th July 2015 to 1st August 2015. The countries very strong in Mathematics subject such as China, Singapore, Philippines, India, Malaysia, South Korea and Thailand were among the competitors and it maximized the credibility of the victory.", "title": "Outstanding Victory for Sri Lanka in the International Mathematics Competition"},
{"content": "2015Second term of government and government approved private schools will end on 30072015 as per the instruction given in circular no. 27/2014. The school calendar will be changed as per the dates amendment of G.C.E. (A/L) examination due to the General Election 2015 falls on 17082015.", "title": "School Calendar  2015"},
{"content": "The ministry of education has taken measures to implement a series of special programs with the aim of providing post graduate degree opportunities for science education, implementing the concept of green harmony schools for sustainable development and creating an energy conscious society.", "title": "Three Memorandum of Understanding on Science Education, Sustainable Development and Energy Consciousness"},
{"content": "The ministry of education has received complaints stating that there is a campaign of collecting unlimited amounts of money from the parents in government schools for a long time on the ground of covering other expenses. A circular has been issued informing to investigate and stop immediately such collections of money and the prior approval from the ministry of education must be obtained if money is charged from the students for any requirement. Information has been received that an extremist political group is planning to use school children for their political activities interpreting the circular in a misleading manner that the government is going to charge money for education.", "title": "Prevention of using school children for narrow political gains"},
{"content": "The ministry of education announces that the last date for receiving applications for admissions to grade six on the results of scholarship examination is 31st March 2015 and the last date for receiving appeals regarding the school admissions is 6th Friday 2015.", "title": "The last date for receiving applications for admissions to grade six on the results of scholarship examination is 31st March 2015 and the last date for receiving appeals regarding the school admissions is 6th Friday 2015."},
{"content": "The communiqué issued by the secretary of education states that although the people come frequently to the Ministry of Education with various demands for making admissions to the national schools, they will not be successful since the minister of education or any other officer will not issue letters to the principals asking them to admit students to their schools. ", "title": "Admission of students to the national schools"},
{"content": "Human resource is the most valuable asset of our country. We can be victorious in our developmental path only through the development of human resource. That is why the new government has drawn its special attention towards it. All the young teachers receiving their appointments today must keep on studying their respective subject areas continuously. Then only new ideas can be generated. The country needs a generation with rational thinking and free of outdated thinking. We provide good targets for teachers to increase the results. They must reach those targets. We formulate a program to give special appreciations to the teachers who will be more successful in the field, said The Minister of Education AkilaVirajKariyawasam.", "title": "It is essential to work rationally without being caged in outdated thinking if you want to be outstanding among commons"},
{"content": "This investigation unit hereafter will be under the direct supervision of an additional secretary and the steps have already been taken to provide all the facilities necessary for investigations to this unit. ", "title": "The number of investigation officers of the ministry of education has increased up to 50"},
{"content": "Cutoff marks of the Grade V scholarship examination held on 2014 has been published.", "title": "Cutoff marks of the Grade V scholarship examination held on 2014"},
{"content": "All island school music competition will be held from 8.00am to 7.00pm on 27th and 28th, June 2015 at 8 schools including Janadhipathi Vidyalaya Maharagama, Dharmapala Vidyalaya Pannipitiya, Dharmapala Vidyalaya Kottawa, Kristuraja Vidyalaya Pannipitiya and Dharmasoka Vidyalaya Maharagama. For this competition 12000 students and 1000 teachers from 450 schools will participate. ", "title": "All Island School Music Competition"},
{"content": "Islamic religious leaders have requested that the first period of the second school term of the Muslim schools to be ended on 17.06.2015 which was scheduled to be ended on 18.06.2015 taking into consideration the fact that the Ramadan fasting season is scheduled to be started on 18.06.2015.", "title": "School Term – 2015"},
{"content": "Applications are called from the suitable candidates with the academic qualification and fitness for the 3 years pre service professional course in Teacher Education at a National Colleges of Education.", "title": "Enrollment of student for National Colleges of Education  2015"},
{"content": "The colleges of education celebrate their 30", "title": "Declaring 2015 as the Year of National Colleges of Education"},
{"content": "Congestion in urban schools with three or four thousand students cannot be reduced by increasing the parallel classes in each grade; to do so, the schools are not factories, Mr. Akila Viraj Kariyawasam states. When the number of children in a class is increased the teacher cannot pay attention to the students individually and as a result of this the small schools in the vicinity will be automatically closed down.  Therefore a policy decision has been taken to limit the number of children in one class to 35 and in the future steps will be taken to reconstruct the system of education as knowledgebased and joboriented, the minister says. The minister of education expressed this while attending the opening ceremony of newly constructed technology laboratory at Parakrama National School, Nikaweratiya recently.", "title": "The schools are not factories where more and more children can be admitted by increasing the number of classrooms."},
{"content": "A march will be started at 8.00am on 16.06.2015 from education ministry premises and go to “Ape Gama” at Battaramulla under the patronage of The Minister of Education AkhilaViraj Kariyawasam with the participation of 400 students representing all the provinces and twenty students from 7 SAARC countries with the objective of mobilizing students for dissemination of knowledge on water, sanitation and hygiene and also for a healthy life.", "title": "Marching of South Asian Student Summit for Water and Sanitation"},
{"content": "The directions given by the Supreme Court to the ministry of education about the necessity of maximum number of children that should be in one parallel class when the children are admitted to grade one of the schools have to be followed.", "title": "When the children are admitted to grade one, the maximum number of children that should be in one class has been determined. "},
{"content": " ", "title": "“I am as the minister of education ready at any time to stand for the officers who do the right thing” "},
{"content": "Mrs. H.C. Fernando took up duties as the chief financial officer of the ministry of education on 20.04.2015. She is qualified with the BSc special degree of State Management from the Jayawardanapura University and passed the examinations up to level II of the Institute of Accountants in Sri Lanka. She joined the Sri Lanka Accountants’ Service in 1984 and was promoted to the special grade of the Accountants’ Service on 09.04.2013.", "title": "Mrs. H.C. Fernando Took Up Duties as the Chief Financial Officer of the Ministry of Education"},
{"content": "The National Level School Information and Communication Technology Champions Tournament will be held for the 7th time in 2015 according to the directions in the circular No. 2011/05 dated 10.02.2011. ", "title": "National Level School Information and Communication Technology Champions Tournament – 2015"},
{"content": "A program to make aware the executive officers including the additional secretaries who are serving in the Ministry of Education on the identification of the tasks of all the sections and how to prepare an implementation plan with the intention of achieving the objectives of the Ministry of Education was conducted under the guidance of human resource development branch of the Ministry of Education at the MAS Fabric Park Institution, Thulhiriya on 24 and 25 of April 2015.", "title": "Capacity Development Program for the Executive Officers of the Ministry of Education"},
{"content": "Pasindu Chathuranga Wijesena and Charith Wickramasingha, the students of Ananda College, Colombo have won the Young Computer Scientist senior section of the 6th National Level School ICT Champions Competitions, 2014 and R.M. Hashan Chamara Rajapaksa of Kandy Model School has won in the junior section. The following teachers and the students have won the awards and certificates as national level champions in the 6th National Level School ICT Champions Competitions, 2014.", "title": "Award Ceremony of the 6th National Level School ICT Champions Competition 2014 Is Held under the Patronage of the Minister of Education"},
{"content": "The government has taken a policy decision that the International and Private Schools functioning in Sri Lanka facilitating general education (between 518 years of age) following local and foreign curricula should be monitored by the Ministry of Education. Therefore, the Managers / Principals of such International and Private Schools are hereby informed to compulsorily submit the duly perfected sheet of information as per the following specimen on or before 20th of April 2015 to reach the address mentioned below.", "title": "Obtaining Information for monitoring Private and International Schools under the 100 Day Program of the Government"},
{"content": "The last date for receiving applications is 30.04.2015. ", "title": "Applications are called for filling the vacancies of principal posts in national schools. "},
{"content": "The gazette notification for recruiting 4400 to the Sri Lanka Principals Service as a part of the program of filling the vacancies in the ministry of education under the 100 day program is scheduled to be issued on 10.04.2015. The teachers serving in government schools and confirmed in the Teachers’ Service having qualifications such as the Bachelor of Education degree from a recognized university or the National Institute of Education with five years satisfactory service in the teachers’ service or having the diploma from a national college of education/ teacher training certificate with six years satisfactory service in the teacher service can apply for this. It has been planned to hold a competitive examination for this purpose in July and the last date for receiving applications is 11.05.2015.", "title": "Fulfilling the targets of hundred day program, 4400 will be recruited to Grade three of the Sri Lanka Principals Service."},
{"content": "'Intel Teach' program was started in 2006 by the Intel institution in collaboration with the ministry of education with the intention of capacity development for the optimum use of information technology in the teaching learning process and to increase the IT knowledge of Sri Lankan teachers. Under this program about 46000 Sri Lankan teachers have been trained. ", "title": "Memorandum of Understanding between the Intel Institution and the Ministry of Education is extended"},
{"content": "New education state ministry secretary Mr. D.N. Nanayakkara assumed duties today (19.01.2015).", "title": "New education state ministry secretary Mr. D.N. Nanayakkara assumes duties"},
{"content": "New education state minister, Nuwara Eliya district parliamentarian V. Radhakrishnan assumed duties today (19.01.2015) after performing all religious observances.", "title": "New Education State Minister V. Radhakrishnan Assumed Duties "},
{"content": "New Minister of Education Akila Viraj Kariyawasam assumed duties as the minister of education today (13.01.2015) after completing all religious observances. ", "title": "New Minister of Education Akila Viraj Kariyawasam Assumed Duties"},
{"content": "Schools assigned for accommodation for police officers on duty at the His Holiness Pope's visit 2015 will be open 16012015 after the vacation given for the Presidential election.", "title": "Visit of His Holiness Popes to Sri Lanka 13012015"},
{"content": "Appreciating ceremony for the honour received by “eThaksalawa” of the Ministry of Education as the best elearning content management system within the country and South Asia and Asia Pacific region in 2014 was held at the premises of the ministry of education under the patronage of the Minister of Education Bandula Gunawardana today (29.12.2014).", "title": "Global Honour for “eThaksalawa” of the Ministry of Education"},
{"content": "The ministry of education and the department of education publications made arrangements to publish a textbook on human rights for the students in secondary grades (Grade 6 to 11) according to the recommendation 6.60 of Lessons Learnt and Reconciliation Commission report and the launching of that book titled “Let’s Protect Rights for Peace” was held at the ministry of education on 22.12.2014 under the patronage of The Minister of Education Bandula Gunawardana. Save the Children institution provided funds for this purpose.", "title": "The Book titled “Let’s Protect Rights for Peace” is launched for school children"},
{"content": "Handing over of several Mahindodaya Technology laboratories in Western Province and North Western Province to the ownership of the students occurred recently under the national program of regenerating 1000 secondary schools with the patronage of The Minister of Education Bandula Gunawardana.", "title": "Six Mahindodaya Technology laboratories in Western and North Western Provinces are handed over to the ownership of the students"},
{"content": "Under the national program of regenerating 1000 secondary schools, several Mahindodaya Technology laboratories will be handed over to the ownership of the students on 25, 26 and 27 of December under the patronage of The Minister of Education Bandula Gunawardana.", "title": "Handing over of several Mahindodaya Technology laboratories to the ownership of the students will occur on 25, 26 and 27"},
{"content": "The Ministry of Education has decided to identify best successful classroom practices with regard to the Teaching Learning Process in the government schools to include in the suggested Resource Manual that would be compiled under the above programme.", "title": "School Based Teacher Development Programme  Identify Best Classroom Practices"},
{"content": "The Ministry of Education has decided to prepare a Resource Directory to assist in developing professional competencies of the teachers in school level to raise the level of achievement of students in Sri Lanka.", "title": "School Based Teacher Development Programme  Preparation of a Resource Directory"},
{"content": "The ceremony to present the certificates and awards of the all island girls’ cricket tournament which was held for the second time was held at the Wesley Playground under the patronage of The Hon. Minister of Education Bandula Gunawardana on 23.09.2014.", "title": "Certificates and awards of the all island girls’ cricket tournament are presented"},
{"content": "The steps have been taken to hold the first stage items of the all island school sports competitions – 2014 which is held annually with the objective of creating a student generation qualified with sports skills, starting from 5th September.", "title": "All island school sports competitions – 2014"},
{"content": "Handing over of teaching appointment letters to 229 national colleges of education diploma holders took place recently at the auditorium of the ministry of education under the patronage of The Minister of Education Bandula Gunawardana.", "title": "Teaching appointments are awarded to 229 national colleges of education diploma holders"},
{"content": "Handing over to the ownership of students Mahindodaya Technology Laboratories built in 9 schools in Badulla and Monaragala districts in Uva Province which were developed under the national program of generating thousand Mahindodaya secondary schools will be occur on 3rd, 4th  and 5th of September, 2014 under the patronage of His Excellence The President Mahinda Rajapaksa.", "title": "Opening of several Mahindodaya Technology Laboratories in Uva by The President"},
{"content": "The ministry of education has   called for the applications to appoint teacher assistants to fill the Tamil medium vacancies in estate schools through the extraordinary gazette notification of the government dated 08.08.2014 including conditions for recruiting and the last date for receiving applications is 05.09.2014.", "title": "Applications are called for the appointment of teacher assistants to fill the Tamil medium vacancies in estate schools"},
{"content": "Applications are accepted for the all island school media social photo competition and the exhibition “Look at the world through the third eye” – 2014 organized by the ministry of education providing an opportunity to spend this August school vacation meaningfully and the details and the application form can be obtained from the web site www.moe.gov.lk of the ministry of education.", "title": "Applications are accepted for the all island school media social photo competition “Look at the world through the third eye”"},
{"content": "The Minister of Education said, the scholars have pointed out that the Economics question paper of the G.C.E. Advanced Level examination 2014 is an excellent question paper produced recently and there is no room for doing anything harmful going by the personal agenda to the lives of numerous students.", "title": "Economics question paper 2014 is an excellent question paper produced recently, scholars say"},
{"content": "Handing over of Kilinochchi Central College, Murugananda Vidyalaya and Warani Vidyalaya in Kilinochchi district to the ownership of students as secondary schools took place under the patronage of the Minister of Education Bandula Gunawardana on 27.07.2014.", "title": "Several schools in Kilinochchi handed over to the ownership of students as secondary schools"},
{"content": "Launching of trilingual road map, distribution of school equipment and awarding of certificates under the “English as a Life Skill” program which is implemented by the president’s program unit of the ministry of education was held on 17.07.2014 at the auditorium of the ministry of education under the patronage of the Minister of Education Bandula Gunawardana.", "title": "Another several phases are started under the “English as a Life Skill” program"},
{"content": "Ifthar function that was organized for the 14th time by the Islam Society of D.S. Senanayaka College, Colombo was held under the patronage of The Minister of Education Bandula Gunawardana at the college recently.", "title": "The Minister of Education Participates in the Ifthar Function at D.S. Senanayaka College"},
{"content": "Handing over of two Mahindodaya Technology Laboratories to the ownership of the students at Basnagala Maha Vidyalaya and Siri Saman Central College, Deraniyagala in Kegalle district under the national program of regenerating thousand secondary schools in order to strengthening a network of five thousand primary schools, took place under the patronage of the Minister of Education Bandula Gunawardana on 16.07.2014.", "title": "Two Mahindodaya Technology Laboratories were opened at Deraniyagala"},
{"content": "The Minister of Education Bandula Gunawardana distributed air tickets among the students participating in Korean International  Mathematics Competition under  Olympiad Mathematics program, at the auditorium of the ministry of education recently (14.07.2014).", "title": "Air tickets are offered to the students participating in Mathematics Olympiad Competition"},
{"content": "The world largest “Esala” procession of students which was organized for the fourth time by the Ministry of Education proceeded in the streets at 2.00pm on 12th July, starting from Mahanama College, Colombo up to Hunupitiya Gangarama temple. His Excellency the President Mahinda Rajapaksa, with the Minister of Education Bandula Gunawardana, stayed to see the procession   from the beginning to the end as to appreciate the skills and talents of students of the country who are pressed in the examination centered education system. More than 200 school dancing troupes from various parts of the island participated in this procession and also more than 15,000 students took part in this event.", "title": "The President joins to see the greatest Esala students’ procession in the world"},
{"content": "Honourable Minister of Education engaged in a four day official tour in South Korea on 25th June 2014.", "title": "The Minister of Education Is Back Home after a Successful Tour in the Republic of Korea"},
{"content": "Award ceremony of the National Mathematics Olympiad competition was held under the patronage of The Minister of Education Bandula Gunawardana at the auditorium of the ministry of education today (15.11.2014). Awards and certificates were presented to 150 national level winners of 2013 and 2014 years. The students selected in this competition at the Zonal and Provincial levels under three categories are included in the national pool annually.", "title": "Awards and certificates of National Mathematics Olympiad competition are presented."},
{"content": "Arrangements have been made to provide following degree opportunities based on the Information and Communication Technology education for the teachers of the Information and Communication Technology by the Information and Communication Technology Branch of the Ministry of Education in collaboration with the Vocational Technology University.", "title": "Degree opportunities based on the Information and Communication Technology Education  2015"},
{"content": "The Minister of Education Bandula Gunawardana stated that in this era of a significant change in the entire Sri Lankan education system, a revolutionary change in the history of the national collages of education also happens and the monthly allowance for all the students of national collages of education will be increased up to 4000 rupees from the January next year.", "title": "Monthly allowance for the students of national collages of education will be increased up to 4000 rupees from the next year"},
{"content": "“ethaksalawa” learning content management system which has been created and maintained by the information and communication technology branch of the ministry of education was honoured on 05.11.2014 as the best creation in the category of 'eLearning and Education'  with the excellent  ‘eswabimani’ National Best eContent Award implemented since 2009 by the Sri Lanka Information and Communication Technology Agency.", "title": "“ethaksalawa” learning content management system is honoured with the award of ‘eswabimani’ National Best eContent Award"},
{"content": "Ministry of Education and the Ministry of Ports and Highways Development have made arrangements to conduct an art, oratory and essay competition among school children in connection with the opening of Northern express way.", "title": "Art, oratory and essay competition among school children in connection with the opening of Northern express way"},
{"content": "The official handing over of the first Innovative ICT classroom which was established in this country as a complete donation from the republic of Korea occurred at the Mahinda Rajapaksa College at Pitipana, Homagama on 21.10.2014 under the patronage of Hon. Minister of Education Bandula Gunawardana.", "title": "The first Innovative ICT classroom in Sri Lanka is established"},
{"content": "As a result of the tours in Korea made by His Excellency the President and Hon. Minister of education and also the long lasting friendship between the ministry of education in Sri Lanka and the Korean ministry of education, Sri Lanka has been selected for the “Innovative ICT Classroom” program fully complete with modern equipment.", "title": "Sri Lanka Joins with “Innovative ICT Classroom” program equipped with modern tools"},
{"content": "All the students admitted to the colleges of education will be awarded a bachelor of education degree from this year. The Minister of Education Bandula Gunawardana said that the arrangements will be made to offer this degree by the national institute of education after providing one year training from the NIE after completing the two year training and one year practical training in the college of education. The minister expressed this when the national colleges of education diploma awarding ceremony was held at the Bandaranayaka Memorial International Conference Hall, Colombo on 15.10.2014 under the patronage of Hon. Minister of Education Bandula Gunawardana.", "title": "National Colleges of Education Diplomas are Awarded"},
{"content": "At the 11th International Mathematics and Science Olympiad Tournament which was held in Bale City of Indonesia from 5th October to 11th October 2014, Sri Lankan students have shown their excellence in the Mathematics section winning two gold medals, two silver medals and two bronze medals.", "title": "Eleventh International Mathematics and Science Olympiad Tournament – 2014"},
{"content": "Launching of the national project to admit all the children who are not attending schools in Sri Lanka before 31st of December is held today at the main hall of the Thurston College, Colombo 07 under the patronage of The Minister of Economic Development Basil Rajapaksa and The Minister of Public Administration and Home Affairs W.D.J.Senevirathna on the invitation of The Minister of Education Bandula Gunawardana.", "title": "A national project is launched on World Children’s Day to admit all the children who are not attending schools in Sri Lanka before 31st of December"},
{"content": "Along with the development of information and communication technology, the use of internet among the students has been rapidly increased. Since it has been reported that the students are encountering with difficult situations on account of misuse of social media and the careless use of internet though the internet can be used effectively for educational purposes, a program to educate about this situation was held with the sponsorship of Microsoft Company at the Hotel Waters Edge under the patronage of Hon. Minister of Education Bandula Gunawardana.", "title": "The workshop on internet security"},
{"content": "The studies done by the Central Environmental Authority have revealed that the people have to face various environmental and hygienic problems because of the irregular disposal of electronic waste which is discarded daily due to the increase of high usage of electronic devices at present.", "title": "National Program for Electronic Waste Management – A Week has been declared for 2014"},
{"content": "It has been planned to establish an Entrepreneurship and Management College of Education for the first time in Sri Lankan history in the premises of Maharagama teacher training college and laying the foundation stone for the three storied building of this college of education was occurred recently with the patronage of the Minister of education Bandula Gunawardana and Dr. Alisher Umarov, head of the education division of the zonal office of the UNESCO in New Delhi, India. ", "title": "The foundation stone is laid for the three storey building of the first Entrepreneurship and Management College of Education in Sri Lanka. "},
{"content": "The Minister of Education Mr. Bandula Gunawardana said that the results of year five scholarships examination will be issued on the first of October the world children’s day from this year. Accordingly the results of year five scholarships examination this year will be issued tomorrow (01.10.2013) the Minister stated.", "title": "The results of year five scholarships examination will be issued on the world children’s day from this year"},
{"content": "Ministry of Education has released the paper notice to admit the students for Grade 1 in 2014 for the government schools. ", "title": "Paper notice on the admission of students to the Grade 1 for the year 2014"},
{"content": "Results of the competitive examination held for following English and Information Technology courses at the National Colleges of Education for 2013 have been released.", "title": "Results of the competitive examination for admissions to English and Information Technology courses at the National Colleges of Education for 2013 are out"},
{"content": " for the enrollment of students for the Grade 6 for the year 2013 of sinhala medium school based on the Grade 5 scholarship examination held in 2012 has been released by the Ministry of Education. ", "title": "Cut off marks for the enrollment of students for the Grade 6 for the year 2013 based Grade 5 scholarship examination has been released"},
{"content": "The arrangements have been made to hold “Lowa Dinana Sisu Prathibha Prabha” the all island school oratory competition which is among the school arts, essay and oratory competitions that are being held in parallel to the summit of Commonwealth heads of states, at Nalanda College, Colombo from 24.10.2013 to 30.10.2013.", "title": "“Lowa Dinana Sisu Prathibha Prabha” all island school oratory competitions from 24th"},
{"content": "The Minister of Education Mr. Bandula Gunawardana said that in line with the teachers’ day 2013 “Guru Prathibha Prabha” felicitation ceremony will be held at the National Institute of Education, Maharagama under the patronage of Hon. Prime Minister Mr. D.M.Jayarathna at 10.00 am on 05.10.2013.", "title": "“Guru Prathibha Prabha” felicitation ceremony under the patronage of Hon. Prime Minister"},
{"content": "The Minister of Education Bandula Gunawardana stated that the thousand secondary schools regenerated with the construction of thousand Mahindodaya Technology Laboratories are examples to the country and he proposes to create at least a small scale agricultural farm in each of these thousand secondary schools. ", "title": "It is proposed to create an agricultural farm in each of the thousand secondary schools"},
{"content": "The Minister of Education Bandula Gunawardana said that it is proposed to conduct national mental health programs from 01 to 10 October next year and it is possible to declare 10th October as the national children’s mental health day. The Minister proposed that it is possible to organize this program involving student leaders representing all the schools in the island.", "title": "Let us declare the 10th October next year children’s mental health day"},
{"content": "Minister of Education Bandula Gunawardana said that fifty four central colleges were established under the Kannangara Vision, now a lot of changes have taken place achieving the knowledge centered objectives of basic education according to the Mahinda Chinthana Prospectus and there will be 1000 central colleges equipped with Mahindodaya technology laboratories by the year 2016. ", "title": "One hundred and twenty ninth birth anniversary of Dr. C.W.W. Kannangara, Father of Free Education is commemorated"},
{"content": "The Minister of Education Bandula Gunawardana said that 800 recruitments will be done to fill all the vacancies in the education administrative service by April next year.", "title": "Measures will be taken to recruit for the 800 vacancies in the education administrative service by April next year"},
{"content": "The grand national book exhibition and sale of the Ministry of Eucation was opened by the Minister of Education Mr. Bandula Gunawardana in the morning on 17.06.2013 at the ministry premises.", "title": "Grand national book exhibition and sale of the Ministry of Education is opened"},
{"content": "According to a concept of Hon. Minister of Education Mr. Bandula Gunawardana, arrangements have been made to hold the national book exhibition and sale of the Ministry of Education from 17.06.2013 to 22.06.2013 at the Ministry of Education premises, Isurupa, Baththaramulla daily from 9.00am to 6.00pm. It has been organized by the Educational Publications Department. ", "title": "Grand national book exhibition and sale of the Ministry of Education from 17.06.2013 to 22.06.2013"},
{"content": "The Sri Lanka Department of Indigenous Medicine set up an Ayurvedic Stall and Nutrition Centre at the Ministry of Education Headquarters at Isurupaya, Battaramulla, on April 23, 2003. It was ceremonially declared open by Minister of Education Bandula Gunawardana.", "title": "An Ayurvedic Stall and Nutrition Centre at Isurupaya"},
{"content": "On the invitation of Gwangju Metropolitan Department of Education in South Korea Hon. Minister of Education Mr. Bandula Gunawardana had special discussions from 09 to 12 September with the Minister of Education of the Republic of Korea, Deputy Chairman of Korean Agency for International Cooperation (KOICA) and the Superintendent of the Gwangju Metropolitan Department of Education in South Korea. In addition to that he attended also the policy forum of Asia Pacific region on early childhood development and education organized by the UNESCO.", "title": "Minister of Education’s official program in the Republic of Korea is successful"},
{"content": "A meeting was held recently at the Ministry of Education between the Minister of Education Mr. Bandula Gunawardana and a Japanese delegation including Professor Yoshiyuke Nagata who served 12 years at the University of the Sacred Heart, Tokyo and currently working as a member of the directive and analytical expert team at the UNESCO headquarters. ", "title": "A meeting between the Minister of Education and a delegation from Japan"},
{"content": "Mr. D.A. Aberathna assumed duties today as the Director of Education in charge of the subject of sports in the Ministry of Education.", "title": "New director for sports takes up duties in the Ministry of Education"},
{"content": "The Secretary of Education has instructed the principals of all schools where the technology subject stream at G.C.E. (Advanced Level) is started for the first time in the system of education in Sri Lanka, to conduct a special meeting with the participation of parents, old pupils and the community at 7.12am on 15.07.2013 for the inauguration of this activity", "title": "Inauguration program of new technology subject stream at G.C.E. (Advanced Level)"},
{"content": "The Minister of Education Mr. Bandula Gunawardana stated that in addition to the subject streams, Arts, Science, Mathematics and Commerce, the stream of Technology will also be added to G. C. E. (Advanced Level) curriculum, from 2013.", "title": "“Technology” is introduced as a new stream into the Advanced Level subject streams"},
{"content": "Results of the G.C.E. (A/L) Examination held in 2012 has released. The results can be obtained through the official website of Department of Examination ", "title": "G.C.E. (A/L) Examination results has released"},
{"content": "The Minister of Education Bandula Gunawardana stated that 39% passed in grade 5 scholarship examination obtaining 70 marks in 2005 when the President Mahinda Rajapakse took up the country but in 2013 it shows higher percentage as 70%. ", "title": "Although 39% passed in grade 5 scholarship examination in 2005 now it has gone up to 70% in 2013"},
{"content": "The Minister of Education Bandula Gunawardana said that the largest capital expenditure for education in Sri Lanka has been allocated in this year’s budget.", "title": "The largest capital expenditure for education in Sri Lanka has been allocated in this year’s budget"},
{"content": "The Minister of Education Bandula Gunawardana said that two new colleges of education are established and for the subject of commerce a new college of education for entrepreneurship and management will be opened next year within the premises of Maharagama training college and 400 students will be admitted to it each year. ", "title": "New College of Education for Entrepreneurship and Management will be opened next year"},
{"content": "The launching of the book titled 'Macroeconomic Variables of Commonwealth Countries' written by the Minister of Education Bandula Gunawardana was taken place at the Temple Trees on 13.11.2013 under the patronage of the President Mahinda Rajapakse. This book has been published in three languages; Sinhala, Tamil and English.", "title": "The book titled 'Macroeconomic Variables of Commonwealth Countries' is launched"},
{"content": "Prizes and certificates awarding ceremony of the “Lowa Dinana Sisu Prathibha Prabha” all island essay, oratory and art competitions that was organized by the Ministry of Education in line with the Commonwealth Heads of States Meeting was held on 11.11.2013 under the patronage of The President Mahinda Rajapakse at the presidential secretariat.", "title": "The President offers awards and certificates to the all island school winners of “Lowa Dinana Sisu Prathibha Prabha” competitions"},
{"content": "The President Mahinda Rajapakse participated in the last ceremony of the cultural procession which was held in the afternoon of 03.11.2013 under the theme of “Heta Apatai Sisu Prathibha Prabha” which included different cultural events from 54 commonwealth countries. ", "title": "The President joins to watch the commonwealth cultural procession"},
{"content": "The memorandum of understanding between the Ministry of Education and the Ministry of Youth Affairs and Skills Development for the purpose of providing the national vocational skills certificate in information technology (NVQ) to the school children who learn the subject of information and communication technology was signed on 18.12.2012. Accordingly this program is coordinated by the information and communication technology branch of the Ministry of Education and the tertiary and vocational education commission of the Ministry of Youth Affairs and Skills Development.", "title": "The program to offer NVQ levels in relation to the subject of Information Technology is launched"},
{"content": "Mr. Mohan Lal Grero assumed duties as the Deputy Minister of Education at the Ministry of Education on 14.10.2013.", "title": "The Deputy Minister of Education takes up duties"},
{"content": "Marking a proud occasion in the process of reaching the new experiences of technology near to the education system of the country the Mobitel in collaboration with the Ministry of Education has taken steps to introduce the “Sisu iCard” project to the student generation of Sri Lanka. This iCard project that was created targeting to observe the daily attendance of the students and several other services was officially launched recently at the Royal College, Colombo under the patronage of the Minister of Education Bandula Gunawardana. ", "title": "Mobitel and the Ministry of Education jointly launch the “Sisu iCard” project"},
{"content": "Beijing foreign language university in China offered a national scholarship on 18.10.2013 under the new Confucius education program introduced by the Hanban institution which is the center of Chinese Confucius institution to the Minister of Education Bandula Gunawardana who has registered as a student for the degree of Philosophy in Beijing foreign language university in China. ", "title": "A scholarship from the government of China to the Minister Bandula for the degree of Philosophy"},
{"content": "Under the directions of His Excellency the President Mahinda Rajapakse the Ministry of Health has declared a mosquito eradicating week from 01st to 07th July 2013 in order to prevent the dengue menace becoming a plague.", "title": "Implementing mosquito eradicating week in educational institutions – 2013"},
{"content": "The Minister of Education Bandula Gunawardana stated that an early childhood education policy will be launched before the end of this year. ", "title": "Measures will be taken to launch the early childhood education policy before the end of this year"},
{"content": " ", "title": "One first place, three second places and five third places this time according to the marks at Grade Five Scholarship Examination"},
{"content": "The Minister of Education Mr. Bandula Gunawardana said that the education policy is formulated to build up the lives of four million students, not only a small group like seven hundred thousand and if he took a wrong decision the effect will be even on the born and unborn generations. ", "title": "Education policy is formulated to build up the lives of four million students"},
{"content": "Yatawaththa Mapa/ Ma/ Weera Parakrama Maha Vidyalaya in Mathale District will be reconstructed to be a prestigious 1AB school within next six months and the handing over of its new three storey building for the use of students by the Minister of Education Mr. Bandula Gunawardana took place recently. ", "title": "New constructions are given to the use of students at Yatawaththa Weera Parakrama Maha Vidyalaya, which is a secondary school"},
{"content": "The Minister of Education Mr. Bandula Gunawardhana says that there are 331 Divisional Secretariats in the country but in 63 Divisional Secretariats there are no 1AB schools (with advanced level science facilities) and that will be changed in the near future by taking actions to provide at least one 1AB school with full facilities to every Divisional Secretariat. ", "title": "Measures will be taken to provide prestigious 1AB school to every Divisional Secretariat."},
{"content": "The Minister of Education Mr. Bandula Gunawardana says that for the first time in Sri Lanka from this year onwards the opportunity to study technology subject stream at G.C.E. Advanced Level in schools throughout the island is provided and accordingly at the first stage 1500 students will be provided with the opportunity to follow degree courses under the technology subject stream. ", "title": "Our aim is to develop the country, not to destroy what we have."},
{"content": "Steps have been taken to conduct all island school sport competitions  2013 in three stages, the Minister of Education Mr. Bandula Gunawardana said.", "title": "All island school sport competitions in three stages"},
{"content": "The Minister of Education Mr. Bandula Gunawardana says that according to UNICEF records, the primary education in Sri Lanka is in a higher position in comparison to the other South Asian countries and it is clearly evident as the children in faraway rural areas also achieve higher results in primary education. The minister expressed this on 04.09.2013 while attending the function of laying the foundation stone for the construction of Mahindodaya technology laboratory building at Maharagama Buwanekaba Vidyalaya which is developed under the thousand schools project. ", "title": "According to UNICEF records, the primary education in Sri Lanka is in a higher position among South Asian countries"},
{"content": "Handing over of Mahindodaya technology laboratory of GIRI/Narammala Maha Vidyalaya for students’ use took place on 03.09.2013 with the patronage of the Minister of Education Mr. Bandula Gunawardana. Speaking at this occasion the minister said that the knowledge of computer is essential for students, after about ten years time the students will have to learn from ebooks and they will have to live in this world with electronic technology.", "title": "Mahindodaya technology laboratory at Giri/Narammala Maha Vidyalaya is handed over to students’ use"},
{"content": "Minister of education Mr. Bandula Gunawardana stated that anybody who does any kind of ragging to the new entrants in the colleges of education will be expelled from the college after a brief inquiry. ", "title": "Measures are been taken to eradicate ragging in the Colleges of Education"},
{"content": "The Aesthetic Branch of the Ministry of Education will present a concert in Galle by the National Youth Orchestra (NYO) for all students in the Southern Province. This event celebrates the revival of the Southern Branch of the NYO earlier this month. The NYO, which is currently in its 21st year of active service, was founded by Mrs. Maya Abeywickrama, the former Deputy Director – Western Music at the Ministry of Education, to provide the opportunity for talented students, particularly from the rural areas, to appreciate and perform Western orchestral music. This venture is the only educational project of its kind to be supported by Statesponsorship. The orchestra has progressed steadily over the last 20 years and recently gained the distinction of being invited to join the Commonwealth Music Partnership established by the Commonwealth Youth Orchestra in the U.K.", "title": "National Youth Orchestra Performs  in Galle on 22nd June 2013"},
{"content": "As for the reason of preparing a proper procedure for the construction of Mahindodaya technology laboratories, 1630 million rupees have been saved for the state and it has been possible to complete successfully the first stage of constructing these laboratories within short period of time, the Minister of Education stated.", "title": "Saving 1630 million rupees through regularization of the construction of Mahindodaya technology laboratories"},
{"content": "Hon. Minister of Education Mr. Bandula Gunawardana expressed that the knowledge of environment is essential for winning life and examinations as well as the victories in the country and the world; the National Institute of Education has included environmental subject matters in the school curriculum.", "title": "Knowledge of environment is essential for winning life and examinations"},
{"content": "Hon. Minister of Education stated that a renowned human resource with skills and technology can be created to the world as a result of introducing technology.", "title": "A prominent human resource can be created to the world through introducing technology"},
{"content": "Dinithi Panchali Rathnayaka a grade 3 student of the Girls’ School, Kegalle who obtained a medal for the country for the first time from the world school chess tournament, met Hon. Minister of Education Mr. Bandula Gunawardana at the Ministry of Education on 17.05.2013 and there he congratulated wishing her to achieve more and more successes in the future.", "title": "Congratulations from the Hon. Minister of Education to world school chess medalist Dinithi"},
{"content": "The award ceremony of the Junior National Mathematics and Science Olympiad Competition  2013  Science (NMSO  Science) has been scheduled to be held, on 31st of May 2013 from 9.00 a.m. ro 1.00 p.m. at the auditorium, Lumbini Vidyalaya, Colombo05, with the presence of Hon. Minister of Education, Mr. Bandula Gunawardena.", "title": "The award ceremony of the Junior National Mathematics and Science Olympiad Competetion2013"},
{"content": " ", "title": "Draft Amendment bill for Pirivenas has been submitted to attorney generals department"},
{"content": "The following amendments are included to the gazette notification on ", "title": "The gazette notification on the recruitment for the Sri Lanka Education Administrative Service (SLEAS) ClassIII has amended."},
{"content": "The minister of education Mr. Bandula Gunawardana said that the cabinet approval has been obtained to establish a National College of Education for Management and Entrepreneurship at Maharagama to award diplomas on entrepreneurship to teach the subject of entrepreneurship education.", "title": "National College of Education for Management and Entrepreneurship"},
{"content": "He said that there are 749 Piriwenas in the island and 168 new teaching appointments were provided to fill the vacancies in 100 Pirivenas. ", "title": "New appointments for Piriwenas were awarded"},
{"content": "Hon. Minister of Education Mr. Bandula Gunawardana stated that the maximum punishments must be imposed on the teachers who do not comply with the transfer orders given by the Ministry of Education under a formal procedure. ", "title": "The Minister of Education has instructed to take disciplinary action against the teachers who do not comply with the transfer orders."},
{"content": "The Minister of Education Mr. Bandula Gunawardana said that a program will be implemented to establish model schools in all 9 provinces and Homagama Maha Vidyalaya has already been named as a model school, accordingly there will be a revolutionary change in education system in the future. ", "title": "A model school will be established in each province"},
{"content": "The first stage of constructing Mahindodaya technical laboratories in thousand schools which belongs to the program of reforming thousand secondary schools is being completed and the second stage of the same has been started. Accordingly laying the foundation by Hon. Minister of Eeducation Mr. Bandula Gunawardana for several Mahindodaya technical laboratories which are constructed in Rathnapura district under the second stage took place recently.", "title": "The second stage of constructing Mahindodaya technical laboratories in Rathnapura schools begins"},
{"content": "A project was launched by the Ministry of Education to create a high level of awareness among parents of the attendance of their children at school and the time of their arrival in and departure from school. ", "title": "Creating awareness among parents of their children’s attendance at school"},
{"content": "Applications are called from the qualified officers for the posts of principal in national schools in the Western, Central, Southern, Uva, Sabaragamuwa, North Western and Eastern provinces. The last date for receiving applications is 31.07.2013 and the details and the specimen application can be obtained from ", "title": "Applications are called for the posts of principal in National Schools."},
{"content": "The specimen of the banner that should be displayed in the schools in relation to the grand national Esala procession of students can be taken from ", "title": "Grand national Esala procession of students takes place this time too."},
{"content": "Minister of Education says that if there is any kind of discrimination happened during the grade five scholarship examination which was held last August the first thing to do is to write about it and inform the Commissioner General of Examinations.", "title": "No room for any injustice to the students who faced the grade five scholarship examination"},
{"content": "According to a Memorandum of Understanding entered between the Ministry of Education and GWANGJU METROPOLITAN Department of Education of Korea, the government of Korea has agreed to provide information technology training opportunities every year for the teachers of Sri Lanka.", "title": "A training for IT teachers from the Department of Education in Korea"},
{"content": "In parallel to the commonwealth summit – 2013 that is scheduled to be held in Sri Lanka from 10 to 17th November 2013 the Ministry of Education has organized an all island essay, arts and debate competitions for school children, said the Minister of Education Mr. Bandula Gunawardana. ", "title": "All island Essay, Arts and Debate competitions in line with the Commonwealth Summit"},
{"content": "Under the memorandum of understanding between the Ministry of Education and Gwangju Metropolitan Education Department of Korea since 2005, a training course is being conducted annually for 20 teachers and officials of information and communication technology. As for the continuation of this program in 2012, 18 teachers and 2 officers of information and communication technology selected from all the provinces, left for Gwangju Metropolitan Education Department in Korea, in the afternoon of 11.09.2012 to follow this short term training.", "title": "A group of information and communication technology teachers leaves for Korea for a short term education programme."},
{"content": "Mr. Anura Dissanayake takes up duties as the Acting Secretary of the Ministry of Education.", "title": "Mr. Anura Dissanayake takes up duties as the Acting Secretary of the Ministry of Education"},
{"content": "The inaugural function of the third stage of “English for all” program which has been conducted for school leavers by the English and Foreign Languages Branch of the ministry of education under the Mahinda Chinthana prospectus and the launching of the teachers’ guide of it was conducted at the auditorium of the ministry on 12.08.2013 under the leadership of the minister of education Mr. Bandula Gunawardana.", "title": "The third stage of “English for all” program is started for school leavers"},
{"content": "Minister of Education Bandula Gunawardana announced that interviews to select graduate teachers to fill vacancies in National Schools will be held this month.", "title": "Interviews to select new graduate teachers for National Schools this month"},
{"content": "T", "title": "2013  Sir John Tarbet Junior School Athletic Tournament is started"},
{"content": "While handing over 175 appointments to fill the vacancies in the Pirivenas throughout the island, at a function held at the auditorium of the Ministry of Education on 29 July 2013 to hand over the appointment letters to new Pirivena teachers, Hon. Minister of Education said that the measures will be taken to start a government approved English medium Pirivena. He further stated that a prominent place has been placed on Pirivena education in the achievement of core developmental objectives in the Mahinda Chinthana prospectus.", "title": "“Measures will be taken to start a government approved English medium Pirivena” says the Minister of Education Mr. Bandula Gunawardana."},
{"content": "Applications are called from the qualified officers to fill the vacancies in the national schools in the Western, Central, Southern, Uva, Sabaragamuwa, North Western, North Central and Eastern Provinces in addition to the national schools appeared in the ", "title": "Applying for the post of Principal in National Schools"},
{"content": "Hon. Minister of education states that it is our responsibility to familiarize the pens and pencils to the hands that were used to fire arms in the country which was under fear and suspicion for more than thirty years and for that purpose, the great duty of shaping up of the future of 330,000 new students who are admitted to the schools today (18) lies with all the teachers and the parents. The minister expressed this while attending the national function for grade one admissions on 18", "title": "It is the duty of all to familiarize the pens and pencils to the hands that were used to fire arms in the country which was under fear and suspicion for more than thirty years."},
{"content": "Hambegamuwa Maha Vidyalaya situated in Thanamalwila divisional secretariat division in Monaragala district has been developed as a full fledged secondary school and handing over of this school to the ownership of the students took place at the school premises at 5.00pm on 15.01.2013 under the patronage of Hon. Minister of education Mr. Bandula Gunawardana.", "title": "Hambegamuwa Maha Vidyalaya developed as a secondary school and dedicated to the students. Amount of money spent is 40 million rupees."},
{"content": "Ministry of Education has relased cut off marks for Tamil medium schools based on Grade 5 scholarship examination held in year 2012. The highest cut off marks are D.S. Senanayake College, Colombo07 from boys schools category  168, BadUddin Balika Vidyalaya, Kandy from girls school category  166 and Zahira Muslim M.M.V., Mawanella from mixed schools category  163.", "title": "Cut off marks for Tamil medium schools based on Grade 5 scholarship Examination has released"},
{"content": "AlcatelLucent Company donated a complete computer laboratory to Wellawaya Kumaradasa Maha Vidyalaya in Uva Province under their social welfare program. It is consisted of 21 latest computers, a multimedia, a laptop computer and several equipment including furniture.", "title": "ICT laboratory of Wellawaya Kumaradasa Maha Vidyalaya declared open by Hon. Minister of Education"},
{"content": "Hon. Minister of education Mr. Bandula Gunawardana mentioned that putting an end to the delay of filling the vacancies in educational administrative service, to generate a quality educational administrative service, the new recruits to the educational administrative service should dedicate to give their knowledge, attitudes and skills sincerely to generate a student population as a valuable resource to the world and a part of the national responsibility of providing a correct leadership lies on their shoulders today, on the way to a knowledge centered educational development. ", "title": "Give your knowledge, abilities and skills sincerely to generate a student population as a valuable resource to the world, in this time of creating a quality development in education"},
{"content": "National function of grade one admissions in 2013 is scheduled to be held at the auspicious time of 9.30am on 18th at Vidyaloka Vidyalaya, Trincomalee under the patronage of Hon. Minister of education Mr. Bandula Gunawardana. ", "title": "National function for grade one admissions of the new year is at Vidyaloka Vidyalaya, Trincomalee"},
{"content": "The government has allocated 3000 million rupees this year for the program that provide free midday meals for school children with the objective of promoting health and nutrition of school children.", "title": "3000 million rupees to provide midday meal for school children"},
{"content": "Signing of the memorandum of understanding between the information and communication technology branch of the ministry of education and the ministry of youth affairs and skill development, in relation to the awarding of the national vocational qualification (NVQ) level 2 or 3 for school children who study information and communication technology in the school curriculum, depending on their qualifications and vocational skills was taken place on 18.12.2012 at the auditorium of the ministry of youth affairs and skills development with the patronage of Hon. Minister of education Mr. Bandula Gunawardana and Hon. Minister of Youth Affairs and Skill Development Mr. Dallas Alahapperuma. Hon. Chief Minister of Western Province Mr. Prasanna Ranathunga, Hon. Supervision MP for Education, Youth Affairs and Skills Development Mr. Mohan Lal Grero, the Secretary of Education Mr. Gotabhaya Jayarathna, Additional Secretary of the Ministry of Youth Affairs and Skill Development Mr. A.R. Deshapriya, Director General of the National Institute of Education professor Abeyrathna Bandara, officials of the two ministries and the heads of other affiliated institutions also participated in this occasion.", "title": "Conjoining the National Vocational Qualification level for school children who study Information and Communication Technology in the school curriculum"}
]